[{"num":1,"ayah_ar":"﻿بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ","ayah_en":"In the name of God, The Most Gracious, The Dispenser of Grace:","numberInSurah":1,"page":1,"surah_ar":"سُورَةُ ٱلْفَاتِحَةِ","surah_en":"Al-Faatiha"},{"num":2,"ayah_ar":"۞ إِنَّ اللَّهَ لَا يَسْتَحْيِي أَنْ يَضْرِبَ مَثَلًا مَا بَعُوضَةً فَمَا فَوْقَهَا ۚ فَأَمَّا الَّذِينَ آمَنُوا فَيَعْلَمُونَ أَنَّهُ الْحَقُّ مِنْ رَبِّهِمْ ۖ وَأَمَّا الَّذِينَ كَفَرُوا فَيَقُولُونَ مَاذَا أَرَادَ اللَّهُ بِهَٰذَا مَثَلًا ۘ يُضِلُّ بِهِ كَثِيرًا وَيَهْدِي بِهِ كَثِيرًا ۚ وَمَا يُضِلُّ بِهِ إِلَّا الْفَاسِقِينَ","ayah_en":"Behold, God does not disdain to propound a parable of a gnat, or of something [even] less than that. Now, as for those who have attained to faith, they know that it is the truth from their Sustainer - whereas those who are bent on denying the truth say, \"What could God mean by this parable?\" In this way does He cause many a one to go astray, just as He guides many a one aright: but none does He cause thereby to go astray save the iniquitous,","numberInSurah":26,"page":5,"surah_ar":"سُورَةُ البَقَرَةِ","surah_en":"Al-Baqara"},{"num":3,"ayah_ar":"۞ أَتَأْمُرُونَ النَّاسَ بِالْبِرِّ وَتَنْسَوْنَ أَنْفُسَكُمْ وَأَنْتُمْ تَتْلُونَ الْكِتَابَ ۚ أَفَلَا تَعْقِلُونَ","ayah_en":"Do you bid other people to be pious, the while you forget your own selves -and yet you recite the divine writ? Will you not, then, use your reason?;","numberInSurah":44,"page":7,"surah_ar":"سُورَةُ البَقَرَةِ","surah_en":"Al-Baqara"},{"num":4,"ayah_ar":"۞ وَإِذِ اسْتَسْقَىٰ مُوسَىٰ لِقَوْمِهِ فَقُلْنَا اضْرِبْ بِعَصَاكَ الْحَجَرَ ۖ فَانْفَجَرَتْ مِنْهُ اثْنَتَا عَشْرَةَ عَيْنًا ۖ قَدْ عَلِمَ كُلُّ أُنَاسٍ مَشْرَبَهُمْ ۖ كُلُوا وَاشْرَبُوا مِنْ رِزْقِ اللَّهِ وَلَا تَعْثَوْا فِي الْأَرْضِ مُفْسِدِينَ","ayah_en":"And [remember] when Moses prayed for water for his people and We replied, \"Strike the rock with thy staff!\"-whereupon twelve springs gushed forth from it, so that all the people knew whence to drink. [And Moses said:] \"Eat and drink the sustenance provided by God, and do not act wickedly on earth by spreading corruption.\"","numberInSurah":60,"page":9,"surah_ar":"سُورَةُ البَقَرَةِ","surah_en":"Al-Baqara"},{"num":5,"ayah_ar":"۞ أَفَتَطْمَعُونَ أَنْ يُؤْمِنُوا لَكُمْ وَقَدْ كَانَ فَرِيقٌ مِنْهُمْ يَسْمَعُونَ كَلَامَ اللَّهِ ثُمَّ يُحَرِّفُونَهُ مِنْ بَعْدِ مَا عَقَلُوهُ وَهُمْ يَعْلَمُونَ","ayah_en":"CAN YOU, then, hope that they will believe in what you are preaching - seeing that a good many of them were wont to listen to the word of God and then, after having understood it, to pervert it knowingly?","numberInSurah":75,"page":11,"surah_ar":"سُورَةُ البَقَرَةِ","surah_en":"Al-Baqara"},{"num":6,"ayah_ar":"۞ وَلَقَدْ جَاءَكُمْ مُوسَىٰ بِالْبَيِّنَاتِ ثُمَّ اتَّخَذْتُمُ الْعِجْلَ مِنْ بَعْدِهِ وَأَنْتُمْ ظَالِمُونَ","ayah_en":"And indeed, there came unto you Moses with all evidence of the truth - and thereupon. in his absence, you took to worshipping the (golden] calf, and acted wickedly.","numberInSurah":92,"page":14,"surah_ar":"سُورَةُ البَقَرَةِ","surah_en":"Al-Baqara"},{"num":7,"ayah_ar":"۞ مَا نَنْسَخْ مِنْ آيَةٍ أَوْ نُنْسِهَا نَأْتِ بِخَيْرٍ مِنْهَا أَوْ مِثْلِهَا ۗ أَلَمْ تَعْلَمْ أَنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","ayah_en":"Any message which, We annul or consign to oblivion We replace with a better or a similar one. Dost thou not know that God has the power to will anything?","numberInSurah":106,"page":17,"surah_ar":"سُورَةُ البَقَرَةِ","surah_en":"Al-Baqara"},{"num":8,"ayah_ar":"۞ وَإِذِ ابْتَلَىٰ إِبْرَاهِيمَ رَبُّهُ بِكَلِمَاتٍ فَأَتَمَّهُنَّ ۖ قَالَ إِنِّي جَاعِلُكَ لِلنَّاسِ إِمَامًا ۖ قَالَ وَمِنْ ذُرِّيَّتِي ۖ قَالَ لَا يَنَالُ عَهْدِي الظَّالِمِينَ","ayah_en":"And [remember this:] when his Sustainer tried Abraham by [His] commandments and the latter fulfilled them, He said: \"Behold, I shall make thee a leader of men. \"Abraham asked: \"And [wilt Thou make leaders] of my offspring as well? \"[God] answered: \"My covenant does not embrace the evildoers.\"","numberInSurah":124,"page":19,"surah_ar":"سُورَةُ البَقَرَةِ","surah_en":"Al-Baqara"},{"num":9,"ayah_ar":"۞ سَيَقُولُ السُّفَهَاءُ مِنَ النَّاسِ مَا وَلَّاهُمْ عَنْ قِبْلَتِهِمُ الَّتِي كَانُوا عَلَيْهَا ۚ قُلْ لِلَّهِ الْمَشْرِقُ وَالْمَغْرِبُ ۚ يَهْدِي مَنْ يَشَاءُ إِلَىٰ صِرَاطٍ مُسْتَقِيمٍ","ayah_en":"THE WEAK-MINDED among people will say, \"What has turned them away from the direction of prayer which they have hitherto observed?\" Say: \"God's is the east and the west; He guides whom He wills onto a straight way.\"","numberInSurah":142,"page":22,"surah_ar":"سُورَةُ البَقَرَةِ","surah_en":"Al-Baqara"},{"num":10,"ayah_ar":"۞ إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ ۖ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا ۚ وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلِيمٌ","ayah_en":"[Hence,] behold, As-Safa and Al-Marwah are among the symbols set up by God; and thus, no wrong does he who, having come to the Temple on pilgrimage or on a pious visit, strides to and fro between these two: for, if one does more good than he is bound to do-behold, God is responsive to gratitude, all-knowing.","numberInSurah":158,"page":24,"surah_ar":"سُورَةُ البَقَرَةِ","surah_en":"Al-Baqara"},{"num":11,"ayah_ar":"۞ لَيْسَ الْبِرَّ أَنْ تُوَلُّوا وُجُوهَكُمْ قِبَلَ الْمَشْرِقِ وَالْمَغْرِبِ وَلَٰكِنَّ الْبِرَّ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَالْمَلَائِكَةِ وَالْكِتَابِ وَالنَّبِيِّينَ وَآتَى الْمَالَ عَلَىٰ حُبِّهِ ذَوِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينَ وَابْنَ السَّبِيلِ وَالسَّائِلِينَ وَفِي الرِّقَابِ وَأَقَامَ الصَّلَاةَ وَآتَى الزَّكَاةَ وَالْمُوفُونَ بِعَهْدِهِمْ إِذَا عَاهَدُوا ۖ وَالصَّابِرِينَ فِي الْبَأْسَاءِ وَالضَّرَّاءِ وَحِينَ الْبَأْسِ ۗ أُولَٰئِكَ الَّذِينَ صَدَقُوا ۖ وَأُولَٰئِكَ هُمُ الْمُتَّقُونَ","ayah_en":"True piety does not consist in turning your faces towards the east or the west - but truly pious is he who believes in God, and the Last Day; and the angels, and revelation, and the prophets; and spends his substance - however much he himself may cherish - it - upon his near of kin, and the orphans, and the needy, and the wayfarer, and the beggars, and for the freeing of human beings from bondage; and is constant in prayer, and renders the purifying dues; and [truly pious are] they who keep their promises whenever they promise, and are patient in misfortune and hardship and in time of peril: it is they that have proved themselves true, and it is they, they who are conscious of God.","numberInSurah":177,"page":27,"surah_ar":"سُورَةُ البَقَرَةِ","surah_en":"Al-Baqara"},{"num":12,"ayah_ar":"۞ يَسْأَلُونَكَ عَنِ الْأَهِلَّةِ ۖ قُلْ هِيَ مَوَاقِيتُ لِلنَّاسِ وَالْحَجِّ ۗ وَلَيْسَ الْبِرُّ بِأَنْ تَأْتُوا الْبُيُوتَ مِنْ ظُهُورِهَا وَلَٰكِنَّ الْبِرَّ مَنِ اتَّقَىٰ ۗ وَأْتُوا الْبُيُوتَ مِنْ أَبْوَابِهَا ۚ وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ","ayah_en":"THEY WILL ASK thee about the new moons. Say: \"They indicate the periods for [various doings of] mankind, including the pilgrimage.\" However, piety does not consist in your entering houses from the rear, [as it were,] but truly pious is he who is conscious of God. Hence, enter houses through their doors, and remain conscious of God, so that you might attain to a happy state.","numberInSurah":189,"page":29,"surah_ar":"سُورَةُ البَقَرَةِ","surah_en":"Al-Baqara"},{"num":13,"ayah_ar":"۞ وَاذْكُرُوا اللَّهَ فِي أَيَّامٍ مَعْدُودَاتٍ ۚ فَمَنْ تَعَجَّلَ فِي يَوْمَيْنِ فَلَا إِثْمَ عَلَيْهِ وَمَنْ تَأَخَّرَ فَلَا إِثْمَ عَلَيْهِ ۚ لِمَنِ اتَّقَىٰ ۗ وَاتَّقُوا اللَّهَ وَاعْلَمُوا أَنَّكُمْ إِلَيْهِ تُحْشَرُونَ","ayah_en":"And bear God in mind during the appointed days; but he who hurries away within two days shall incur no sin, and he who tarries longer shall incur no sin, provided that he is conscious of God. Hence, remain conscious of God, and know that unto Him you shall be gathered.","numberInSurah":203,"page":32,"surah_ar":"سُورَةُ البَقَرَةِ","surah_en":"Al-Baqara"},{"num":14,"ayah_ar":"۞ يَسْأَلُونَكَ عَنِ الْخَمْرِ وَالْمَيْسِرِ ۖ قُلْ فِيهِمَا إِثْمٌ كَبِيرٌ وَمَنَافِعُ لِلنَّاسِ وَإِثْمُهُمَا أَكْبَرُ مِنْ نَفْعِهِمَا ۗ وَيَسْأَلُونَكَ مَاذَا يُنْفِقُونَ قُلِ الْعَفْوَ ۗ كَذَٰلِكَ يُبَيِّنُ اللَّهُ لَكُمُ الْآيَاتِ لَعَلَّكُمْ تَتَفَكَّرُونَ","ayah_en":"THEY WILL ASK thee about intoxicants and games of chance. Say: \"In both there is great evil as well as some benefit for man; but the evil which they cause is greater than the benefit which they bring.\" And they will ask thee as to what they should spend [in God's cause]. Say: \"Whatever you can spare.\" In this way God makes clear unto you His messages, so that you might reflect","numberInSurah":219,"page":34,"surah_ar":"سُورَةُ البَقَرَةِ","surah_en":"Al-Baqara"},{"num":15,"ayah_ar":"۞ وَالْوَالِدَاتُ يُرْضِعْنَ أَوْلَادَهُنَّ حَوْلَيْنِ كَامِلَيْنِ ۖ لِمَنْ أَرَادَ أَنْ يُتِمَّ الرَّضَاعَةَ ۚ وَعَلَى الْمَوْلُودِ لَهُ رِزْقُهُنَّ وَكِسْوَتُهُنَّ بِالْمَعْرُوفِ ۚ لَا تُكَلَّفُ نَفْسٌ إِلَّا وُسْعَهَا ۚ لَا تُضَارَّ وَالِدَةٌ بِوَلَدِهَا وَلَا مَوْلُودٌ لَهُ بِوَلَدِهِ ۚ وَعَلَى الْوَارِثِ مِثْلُ ذَٰلِكَ ۗ فَإِنْ أَرَادَا فِصَالًا عَنْ تَرَاضٍ مِنْهُمَا وَتَشَاوُرٍ فَلَا جُنَاحَ عَلَيْهِمَا ۗ وَإِنْ أَرَدْتُمْ أَنْ تَسْتَرْضِعُوا أَوْلَادَكُمْ فَلَا جُنَاحَ عَلَيْكُمْ إِذَا سَلَّمْتُمْ مَا آتَيْتُمْ بِالْمَعْرُوفِ ۗ وَاتَّقُوا اللَّهَ وَاعْلَمُوا أَنَّ اللَّهَ بِمَا تَعْمَلُونَ بَصِيرٌ","ayah_en":"And the [divorced] mothers may nurse their children for two whole years, if they wish to complete the period of nursing; and it is incumbent upon him who has begotten the child to provide in a fair manner for their sustenance and clothing. No human being shall be burdened with more than he is well able to bear: neither shall a mother be made to suffer because of her child, nor, because of his child, he who has begotten it. And the same duty rests upon the [father's] heir. And if both [parents] decide, by mutual consent and counsel, upon separation [of mother and child], they will incur no sin [thereby]; and if you decide to entrust your children to foster-mothers, you will incur no sin provided you ensure, in a fair manner, the safety of the child which you are handing over. But remain conscious of God, and know that God sees all that you do.","numberInSurah":233,"page":37,"surah_ar":"سُورَةُ البَقَرَةِ","surah_en":"Al-Baqara"},{"num":16,"ayah_ar":"۞ أَلَمْ تَرَ إِلَى الَّذِينَ خَرَجُوا مِنْ دِيَارِهِمْ وَهُمْ أُلُوفٌ حَذَرَ الْمَوْتِ فَقَالَ لَهُمُ اللَّهُ مُوتُوا ثُمَّ أَحْيَاهُمْ ۚ إِنَّ اللَّهَ لَذُو فَضْلٍ عَلَى النَّاسِ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَشْكُرُونَ","ayah_en":"ART THOU NOT aware of those who forsook their homelands in their thousands for fear of death-whereupon God said unto them, \"Die,\" and later brought them back to life? Behold, God is indeed limitless in His bounty unto man -but most people are ungrateful.","numberInSurah":243,"page":39,"surah_ar":"سُورَةُ البَقَرَةِ","surah_en":"Al-Baqara"},{"num":17,"ayah_ar":"۞ تِلْكَ الرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَىٰ بَعْضٍ ۘ مِنْهُمْ مَنْ كَلَّمَ اللَّهُ ۖ وَرَفَعَ بَعْضَهُمْ دَرَجَاتٍ ۚ وَآتَيْنَا عِيسَى ابْنَ مَرْيَمَ الْبَيِّنَاتِ وَأَيَّدْنَاهُ بِرُوحِ الْقُدُسِ ۗ وَلَوْ شَاءَ اللَّهُ مَا اقْتَتَلَ الَّذِينَ مِنْ بَعْدِهِمْ مِنْ بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَاتُ وَلَٰكِنِ اخْتَلَفُوا فَمِنْهُمْ مَنْ آمَنَ وَمِنْهُمْ مَنْ كَفَرَ ۚ وَلَوْ شَاءَ اللَّهُ مَا اقْتَتَلُوا وَلَٰكِنَّ اللَّهَ يَفْعَلُ مَا يُرِيدُ","ayah_en":"Some of these apostles have We endowed more highly than others: among them were such as were spoken to by God [Himself], and some He has raised yet higher.' And We vouchsafed unto Jesus, the son of Mary, all evidence of the truth, and strengthened him with holy inspiration. And if God had so willed, they who succeeded those [apostles] would not have contended with one another after all evidence of the truth had come to them; but [as it was,] they did take to divergent views, and some of them attained to faith, while some of them came to deny the truth. Yet if God had so willed, they would not have contended with one another: but God does whatever He wills.","numberInSurah":253,"page":42,"surah_ar":"سُورَةُ البَقَرَةِ","surah_en":"Al-Baqara"},{"num":18,"ayah_ar":"۞ قَوْلٌ مَعْرُوفٌ وَمَغْفِرَةٌ خَيْرٌ مِنْ صَدَقَةٍ يَتْبَعُهَا أَذًى ۗ وَاللَّهُ غَنِيٌّ حَلِيمٌ","ayah_en":"A kind word and the veiling of another's want is better than a charitable deed followed by hurt; and God is self-sufficient, forbearing.","numberInSurah":263,"page":44,"surah_ar":"سُورَةُ البَقَرَةِ","surah_en":"Al-Baqara"},{"num":19,"ayah_ar":"۞ لَيْسَ عَلَيْكَ هُدَاهُمْ وَلَٰكِنَّ اللَّهَ يَهْدِي مَنْ يَشَاءُ ۗ وَمَا تُنْفِقُوا مِنْ خَيْرٍ فَلِأَنْفُسِكُمْ ۚ وَمَا تُنْفِقُونَ إِلَّا ابْتِغَاءَ وَجْهِ اللَّهِ ۚ وَمَا تُنْفِقُوا مِنْ خَيْرٍ يُوَفَّ إِلَيْكُمْ وَأَنْتُمْ لَا تُظْلَمُونَ","ayah_en":"It is not for thee [O Prophet] to make people follow the right path, since it is God [alone] who guides whom He wills. And whatever good you may spend on others is for your own good, provided that you spend only out of a longing for God's countenance: for, whatever good you may spend will be repaid unto you in full, and you shall not be wronged.","numberInSurah":272,"page":46,"surah_ar":"سُورَةُ البَقَرَةِ","surah_en":"Al-Baqara"},{"num":20,"ayah_ar":"۞ وَإِنْ كُنْتُمْ عَلَىٰ سَفَرٍ وَلَمْ تَجِدُوا كَاتِبًا فَرِهَانٌ مَقْبُوضَةٌ ۖ فَإِنْ أَمِنَ بَعْضُكُمْ بَعْضًا فَلْيُؤَدِّ الَّذِي اؤْتُمِنَ أَمَانَتَهُ وَلْيَتَّقِ اللَّهَ رَبَّهُ ۗ وَلَا تَكْتُمُوا الشَّهَادَةَ ۚ وَمَنْ يَكْتُمْهَا فَإِنَّهُ آثِمٌ قَلْبُهُ ۗ وَاللَّهُ بِمَا تَعْمَلُونَ عَلِيمٌ","ayah_en":"And if you are on a journey and cannot find a scribe, pledges [may be taken] in hand: but if you trust one another, then let him who is trusted fulfil his trust, and let him be conscious of God, his Sustainer. And do not conceal what you have witnessed - for, verily, he who conceals it is sinful at heart; and God has full knowledge of all that you do.","numberInSurah":283,"page":49,"surah_ar":"سُورَةُ البَقَرَةِ","surah_en":"Al-Baqara"},{"num":21,"ayah_ar":"۞ قُلْ أَؤُنَبِّئُكُمْ بِخَيْرٍ مِنْ ذَٰلِكُمْ ۚ لِلَّذِينَ اتَّقَوْا عِنْدَ رَبِّهِمْ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا وَأَزْوَاجٌ مُطَهَّرَةٌ وَرِضْوَانٌ مِنَ اللَّهِ ۗ وَاللَّهُ بَصِيرٌ بِالْعِبَادِ","ayah_en":"Say: \"Shall I tell you of better things than those [earthly joys]? For the God-conscious there are, with their Sustainer, gardens through which running waters flow, therein to abide, and spouses pure, and God's goodly acceptance.\" And God sees all that is in [the hearts of] His servants -","numberInSurah":15,"page":51,"surah_ar":"سُورَةُ آلِ عِمۡرَانَ","surah_en":"Aal-i-Imraan"},{"num":22,"ayah_ar":"۞ إِنَّ اللَّهَ اصْطَفَىٰ آدَمَ وَنُوحًا وَآلَ إِبْرَاهِيمَ وَآلَ عِمْرَانَ عَلَى الْعَالَمِينَ","ayah_en":"BEHOLD, God raised Adam, and Noah, and the House of Abraham, and the House of `Imran above all mankind,","numberInSurah":33,"page":54,"surah_ar":"سُورَةُ آلِ عِمۡرَانَ","surah_en":"Aal-i-Imraan"},{"num":23,"ayah_ar":"۞ فَلَمَّا أَحَسَّ عِيسَىٰ مِنْهُمُ الْكُفْرَ قَالَ مَنْ أَنْصَارِي إِلَى اللَّهِ ۖ قَالَ الْحَوَارِيُّونَ نَحْنُ أَنْصَارُ اللَّهِ آمَنَّا بِاللَّهِ وَاشْهَدْ بِأَنَّا مُسْلِمُونَ","ayah_en":"And when Jesus became aware of their refusal to acknowledge the truth, he asked: \"Who will be my helpers in God's cause?\" The white-garbed ones replied: \"We shall be [thy] helpers [in the cause] of God! We believe in God: and bear thou witness that we have surrendered ourselves unto Him!","numberInSurah":52,"page":56,"surah_ar":"سُورَةُ آلِ عِمۡرَانَ","surah_en":"Aal-i-Imraan"},{"num":24,"ayah_ar":"۞ وَمِنْ أَهْلِ الْكِتَابِ مَنْ إِنْ تَأْمَنْهُ بِقِنْطَارٍ يُؤَدِّهِ إِلَيْكَ وَمِنْهُمْ مَنْ إِنْ تَأْمَنْهُ بِدِينَارٍ لَا يُؤَدِّهِ إِلَيْكَ إِلَّا مَا دُمْتَ عَلَيْهِ قَائِمًا ۗ ذَٰلِكَ بِأَنَّهُمْ قَالُوا لَيْسَ عَلَيْنَا فِي الْأُمِّيِّينَ سَبِيلٌ وَيَقُولُونَ عَلَى اللَّهِ الْكَذِبَ وَهُمْ يَعْلَمُونَ","ayah_en":"AND AMONG the followers of earlier revelation there is many a one who, if thou entrust him with a treasure, will [faithfully] restore it to thee; and there is among them many a one who, if thou entrust him with a tiny gold coin, will not restore it to thee unless thou keep standing over him - which is an outcome of their assertion, \"No blame can attach to us [for anything that we may do] with regard to these unlettered folk\": and [so] they tell a lie about God, being well aware [that it is a lie].\"","numberInSurah":75,"page":59,"surah_ar":"سُورَةُ آلِ عِمۡرَانَ","surah_en":"Aal-i-Imraan"},{"num":25,"ayah_ar":"۞ كُلُّ الطَّعَامِ كَانَ حِلًّا لِبَنِي إِسْرَائِيلَ إِلَّا مَا حَرَّمَ إِسْرَائِيلُ عَلَىٰ نَفْسِهِ مِنْ قَبْلِ أَنْ تُنَزَّلَ التَّوْرَاةُ ۗ قُلْ فَأْتُوا بِالتَّوْرَاةِ فَاتْلُوهَا إِنْ كُنْتُمْ صَادِقِينَ","ayah_en":"ALL FOOD was lawful unto the children of Israel, save what Israel had made unlawful unto itself [by its sinning] before the Torah was bestowed from on high. Say: \"Come forward, then, with the Torah and recite it, if what you say is true!\"","numberInSurah":93,"page":62,"surah_ar":"سُورَةُ آلِ عِمۡرَانَ","surah_en":"Aal-i-Imraan"},{"num":26,"ayah_ar":"۞ لَيْسُوا سَوَاءً ۗ مِنْ أَهْلِ الْكِتَابِ أُمَّةٌ قَائِمَةٌ يَتْلُونَ آيَاتِ اللَّهِ آنَاءَ اللَّيْلِ وَهُمْ يَسْجُدُونَ","ayah_en":"[But] they are not all alike: among the followers of earlier revelation there are upright people, who recite God's messages throughout the night, and prostrate themselves [before Him].","numberInSurah":113,"page":64,"surah_ar":"سُورَةُ آلِ عِمۡرَانَ","surah_en":"Aal-i-Imraan"},{"num":27,"ayah_ar":"۞ وَسَارِعُوا إِلَىٰ مَغْفِرَةٍ مِنْ رَبِّكُمْ وَجَنَّةٍ عَرْضُهَا السَّمَاوَاتُ وَالْأَرْضُ أُعِدَّتْ لِلْمُتَّقِينَ","ayah_en":"And vie with one another to attain to your Sustainer's forgiveness and to a paradise as vast as the heavens and the earth, which has been readied for the God-conscious","numberInSurah":133,"page":67,"surah_ar":"سُورَةُ آلِ عِمۡرَانَ","surah_en":"Aal-i-Imraan"},{"num":28,"ayah_ar":"۞ إِذْ تُصْعِدُونَ وَلَا تَلْوُونَ عَلَىٰ أَحَدٍ وَالرَّسُولُ يَدْعُوكُمْ فِي أُخْرَاكُمْ فَأَثَابَكُمْ غَمًّا بِغَمٍّ لِكَيْلَا تَحْزَنُوا عَلَىٰ مَا فَاتَكُمْ وَلَا مَا أَصَابَكُمْ ۗ وَاللَّهُ خَبِيرٌ بِمَا تَعْمَلُونَ","ayah_en":"[Remember the time] when you fled, paying no heed to anyone, while at your rear the Apostle was calling out to you - wherefore He requited you with woe in return for [the Apostle's] woe, so that you should not grieve [merely] over what had escaped you, nor over what had befallen you: for God is aware of all that you do.","numberInSurah":153,"page":69,"surah_ar":"سُورَةُ آلِ عِمۡرَانَ","surah_en":"Aal-i-Imraan"},{"num":29,"ayah_ar":"۞ يَسْتَبْشِرُونَ بِنِعْمَةٍ مِنَ اللَّهِ وَفَضْلٍ وَأَنَّ اللَّهَ لَا يُضِيعُ أَجْرَ الْمُؤْمِنِينَ","ayah_en":"they rejoice in the glad tiding of God's blessings and bounty, and [in the promise] that God will not fail to requite the believers","numberInSurah":171,"page":72,"surah_ar":"سُورَةُ آلِ عِمۡرَانَ","surah_en":"Aal-i-Imraan"},{"num":30,"ayah_ar":"۞ لَتُبْلَوُنَّ فِي أَمْوَالِكُمْ وَأَنْفُسِكُمْ وَلَتَسْمَعُنَّ مِنَ الَّذِينَ أُوتُوا الْكِتَابَ مِنْ قَبْلِكُمْ وَمِنَ الَّذِينَ أَشْرَكُوا أَذًى كَثِيرًا ۚ وَإِنْ تَصْبِرُوا وَتَتَّقُوا فَإِنَّ ذَٰلِكَ مِنْ عَزْمِ الْأُمُورِ","ayah_en":"You shall most certainly be tried in your possessions and in your persons; and indeed you shall hear many hurtful things from those to whom revelation was granted before your time, as well as from those who have come to ascribe divinity to other beings beside God. But if you remain patient in adversity and conscious of Him - this, behold, is something to set one's heart upon.","numberInSurah":186,"page":74,"surah_ar":"سُورَةُ آلِ عِمۡرَانَ","surah_en":"Aal-i-Imraan"},{"num":31,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ وَخَلَقَ مِنْهَا زَوْجَهَا وَبَثَّ مِنْهُمَا رِجَالًا كَثِيرًا وَنِسَاءً ۚ وَاتَّقُوا اللَّهَ الَّذِي تَسَاءَلُونَ بِهِ وَالْأَرْحَامَ ۚ إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا","ayah_en":"O MANKIND! Be conscious of your Sustainer, who has created you out of one living entity, and out of it created its mate, and out of the two spread abroad a multitude of men and women. And remain conscious of God, in whose name you demand [your rights] from one another, and of these ties of kinship. Verily, God is ever watchful over you!","numberInSurah":1,"page":77,"surah_ar":"سُورَةُ النِّسَاءِ","surah_en":"An-Nisaa"},{"num":32,"ayah_ar":"۞ وَلَكُمْ نِصْفُ مَا تَرَكَ أَزْوَاجُكُمْ إِنْ لَمْ يَكُنْ لَهُنَّ وَلَدٌ ۚ فَإِنْ كَانَ لَهُنَّ وَلَدٌ فَلَكُمُ الرُّبُعُ مِمَّا تَرَكْنَ ۚ مِنْ بَعْدِ وَصِيَّةٍ يُوصِينَ بِهَا أَوْ دَيْنٍ ۚ وَلَهُنَّ الرُّبُعُ مِمَّا تَرَكْتُمْ إِنْ لَمْ يَكُنْ لَكُمْ وَلَدٌ ۚ فَإِنْ كَانَ لَكُمْ وَلَدٌ فَلَهُنَّ الثُّمُنُ مِمَّا تَرَكْتُمْ ۚ مِنْ بَعْدِ وَصِيَّةٍ تُوصُونَ بِهَا أَوْ دَيْنٍ ۗ وَإِنْ كَانَ رَجُلٌ يُورَثُ كَلَالَةً أَوِ امْرَأَةٌ وَلَهُ أَخٌ أَوْ أُخْتٌ فَلِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسُ ۚ فَإِنْ كَانُوا أَكْثَرَ مِنْ ذَٰلِكَ فَهُمْ شُرَكَاءُ فِي الثُّلُثِ ۚ مِنْ بَعْدِ وَصِيَّةٍ يُوصَىٰ بِهَا أَوْ دَيْنٍ غَيْرَ مُضَارٍّ ۚ وَصِيَّةً مِنَ اللَّهِ ۗ وَاللَّهُ عَلِيمٌ حَلِيمٌ","ayah_en":"And you shall inherit one-half of what your wives leave behind, provided they have left no child; but if they have left a child, then you shall have one-quarter of what they leave behind, after [the deduction of] any bequest they may have made, or any debt [they may have incurred]. And your widows shall have one-quarter of what you leave behind, provided you have left no child; but if you have left a child, then they shall have one-eighth of what you leave behind, after [the deduction of] any bequest you may have made, or any debt [you may have incurred]. And if a man or a woman has no heir in the direct line, but has a brother or a sister, then each of these two shall inherit one-sixth; but if there are more than two, then they shall share in one-third [of the inheritance], after [the deduction of] any bequest that may have been made, or any debt [that may have been incurred], neither of which having been intended to harm [the heirs]. [This is] an injunction from God: and God is all-knowing, forbearing.","numberInSurah":12,"page":79,"surah_ar":"سُورَةُ النِّسَاءِ","surah_en":"An-Nisaa"},{"num":33,"ayah_ar":"۞ وَالْمُحْصَنَاتُ مِنَ النِّسَاءِ إِلَّا مَا مَلَكَتْ أَيْمَانُكُمْ ۖ كِتَابَ اللَّهِ عَلَيْكُمْ ۚ وَأُحِلَّ لَكُمْ مَا وَرَاءَ ذَٰلِكُمْ أَنْ تَبْتَغُوا بِأَمْوَالِكُمْ مُحْصِنِينَ غَيْرَ مُسَافِحِينَ ۚ فَمَا اسْتَمْتَعْتُمْ بِهِ مِنْهُنَّ فَآتُوهُنَّ أُجُورَهُنَّ فَرِيضَةً ۚ وَلَا جُنَاحَ عَلَيْكُمْ فِيمَا تَرَاضَيْتُمْ بِهِ مِنْ بَعْدِ الْفَرِيضَةِ ۚ إِنَّ اللَّهَ كَانَ عَلِيمًا حَكِيمًا","ayah_en":"And [forbidden to you are] all married women other than those whom you rightfully possess [through wedlock]: this is God's ordinance, binding upon you. But lawful to you are all [women] beyond these, for you to seek out, offering them of your possessions, taking them in honest wedlock, and not in fornication. And unto those with whom you desire to enjoy marriage, you shall give the dowers due to them; but you will incur no sin if, after [having agreed upon] this lawful due, you freely agree with one another upon anything [else]: behold, God is indeed all-knowing, wise.","numberInSurah":24,"page":82,"surah_ar":"سُورَةُ النِّسَاءِ","surah_en":"An-Nisaa"},{"num":34,"ayah_ar":"۞ وَاعْبُدُوا اللَّهَ وَلَا تُشْرِكُوا بِهِ شَيْئًا ۖ وَبِالْوَالِدَيْنِ إِحْسَانًا وَبِذِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينِ وَالْجَارِ ذِي الْقُرْبَىٰ وَالْجَارِ الْجُنُبِ وَالصَّاحِبِ بِالْجَنْبِ وَابْنِ السَّبِيلِ وَمَا مَلَكَتْ أَيْمَانُكُمْ ۗ إِنَّ اللَّهَ لَا يُحِبُّ مَنْ كَانَ مُخْتَالًا فَخُورًا","ayah_en":"AND WORSHIP God [alone], and do not ascribe divinity, in any way, to aught beside Him. And do good unto your parents, and near of kin, and unto orphans, and the needy, and the neighbour from among your own people, and the neighbour who is a stranger, and the friend by your side, and the wayfarer, and those whom you rightfully possess. Verily, God does not love any of those who, full of self-conceit, act in a boastful manner;","numberInSurah":36,"page":84,"surah_ar":"سُورَةُ النِّسَاءِ","surah_en":"An-Nisaa"},{"num":35,"ayah_ar":"۞ إِنَّ اللَّهَ يَأْمُرُكُمْ أَنْ تُؤَدُّوا الْأَمَانَاتِ إِلَىٰ أَهْلِهَا وَإِذَا حَكَمْتُمْ بَيْنَ النَّاسِ أَنْ تَحْكُمُوا بِالْعَدْلِ ۚ إِنَّ اللَّهَ نِعِمَّا يَعِظُكُمْ بِهِ ۗ إِنَّ اللَّهَ كَانَ سَمِيعًا بَصِيرًا","ayah_en":"BEHOLD, God bids you to deliver all that you have been entrusted with unto those who are entitled thereto, and whenever you judge between people, to judge with justice. Verily, most excellent is what God exhorts you to do: verily, God is all-hearing, all-seeing!","numberInSurah":58,"page":87,"surah_ar":"سُورَةُ النِّسَاءِ","surah_en":"An-Nisaa"},{"num":36,"ayah_ar":"۞ فَلْيُقَاتِلْ فِي سَبِيلِ اللَّهِ الَّذِينَ يَشْرُونَ الْحَيَاةَ الدُّنْيَا بِالْآخِرَةِ ۚ وَمَنْ يُقَاتِلْ فِي سَبِيلِ اللَّهِ فَيُقْتَلْ أَوْ يَغْلِبْ فَسَوْفَ نُؤْتِيهِ أَجْرًا عَظِيمًا","ayah_en":"Hence, let them fight in God's cause - all who are willing to barter the life of this world for the life to come: for unto him who fights in God's cause, whether he be slain or be victorious, We shall in time grant a mighty reward.","numberInSurah":74,"page":89,"surah_ar":"سُورَةُ النِّسَاءِ","surah_en":"An-Nisaa"},{"num":37,"ayah_ar":"۞ فَمَا لَكُمْ فِي الْمُنَافِقِينَ فِئَتَيْنِ وَاللَّهُ أَرْكَسَهُمْ بِمَا كَسَبُوا ۚ أَتُرِيدُونَ أَنْ تَهْدُوا مَنْ أَضَلَّ اللَّهُ ۖ وَمَنْ يُضْلِلِ اللَّهُ فَلَنْ تَجِدَ لَهُ سَبِيلًا","ayah_en":"How, then, could you be of two minds about the hypocrites, seeing that God [Himself] has disowned them because of their guilt? Do you, perchance, seek to guide those whom God has let go astray - when for him whom God lets go astray thou canst never find any way?","numberInSurah":88,"page":92,"surah_ar":"سُورَةُ النِّسَاءِ","surah_en":"An-Nisaa"},{"num":38,"ayah_ar":"۞ وَمَنْ يُهَاجِرْ فِي سَبِيلِ اللَّهِ يَجِدْ فِي الْأَرْضِ مُرَاغَمًا كَثِيرًا وَسَعَةً ۚ وَمَنْ يَخْرُجْ مِنْ بَيْتِهِ مُهَاجِرًا إِلَى اللَّهِ وَرَسُولِهِ ثُمَّ يُدْرِكْهُ الْمَوْتُ فَقَدْ وَقَعَ أَجْرُهُ عَلَى اللَّهِ ۗ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا","ayah_en":"And he who forsakes the domain of evil for the sake of God shall find on earth many a lonely road, as well as life abundant. And if anyone leaves his home, fleeing from evil unto God and His Apostle, and then death overtakes him - his reward is ready with God: for God iss indeed much-forgiving, a dis­penser of grace.","numberInSurah":100,"page":94,"surah_ar":"سُورَةُ النِّسَاءِ","surah_en":"An-Nisaa"},{"num":39,"ayah_ar":"۞ لَا خَيْرَ فِي كَثِيرٍ مِنْ نَجْوَاهُمْ إِلَّا مَنْ أَمَرَ بِصَدَقَةٍ أَوْ مَعْرُوفٍ أَوْ إِصْلَاحٍ بَيْنَ النَّاسِ ۚ وَمَنْ يَفْعَلْ ذَٰلِكَ ابْتِغَاءَ مَرْضَاتِ اللَّهِ فَسَوْفَ نُؤْتِيهِ أَجْرًا عَظِيمًا","ayah_en":"NO GOOD comes, as a rule, out of secret confabulations - saving such as are devoted to en­joining charity, or equitable dealings, or setting things to rights between people: and unto him who does this out of a longing for God's goodly acceptance We shall in time grant a mighty reward.","numberInSurah":114,"page":97,"surah_ar":"سُورَةُ النِّسَاءِ","surah_en":"An-Nisaa"},{"num":40,"ayah_ar":"۞ يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ بِالْقِسْطِ شُهَدَاءَ لِلَّهِ وَلَوْ عَلَىٰ أَنْفُسِكُمْ أَوِ الْوَالِدَيْنِ وَالْأَقْرَبِينَ ۚ إِنْ يَكُنْ غَنِيًّا أَوْ فَقِيرًا فَاللَّهُ أَوْلَىٰ بِهِمَا ۖ فَلَا تَتَّبِعُوا الْهَوَىٰ أَنْ تَعْدِلُوا ۚ وَإِنْ تَلْوُوا أَوْ تُعْرِضُوا فَإِنَّ اللَّهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا","ayah_en":"O YOU who have attained to faith! Be ever steadfast in upholding equity, bearing witness to the truth for the sake of God, even though it be against your own selves or your parents and kinsfolk. Whether the person concerned be rich or poor, God's claim takes precedence over [the claims of] either of them. Do not, then, follow your own desires, lest you swerve from justice: for if you distort [the truth], behold, God is indeed aware of all that you do!","numberInSurah":135,"page":100,"surah_ar":"سُورَةُ النِّسَاءِ","surah_en":"An-Nisaa"},{"num":41,"ayah_ar":"۞ لَا يُحِبُّ اللَّهُ الْجَهْرَ بِالسُّوءِ مِنَ الْقَوْلِ إِلَّا مَنْ ظُلِمَ ۚ وَكَانَ اللَّهُ سَمِيعًا عَلِيمًا","ayah_en":"God does not like any evil to be mentioned openly, unless it be by him who has been wronged (thereby) And God is indeed all-hearing, all-knowing,","numberInSurah":148,"page":102,"surah_ar":"سُورَةُ النِّسَاءِ","surah_en":"An-Nisaa"},{"num":42,"ayah_ar":"۞ إِنَّا أَوْحَيْنَا إِلَيْكَ كَمَا أَوْحَيْنَا إِلَىٰ نُوحٍ وَالنَّبِيِّينَ مِنْ بَعْدِهِ ۚ وَأَوْحَيْنَا إِلَىٰ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالْأَسْبَاطِ وَعِيسَىٰ وَأَيُّوبَ وَيُونُسَ وَهَارُونَ وَسُلَيْمَانَ ۚ وَآتَيْنَا دَاوُودَ زَبُورًا","ayah_en":"BEHOLD, We have inspired thee [O Prophet] just as We inspired Noah and all the prophets after him - as We inspired Abraham, and Ishmael, and Isaac, and Jacob, and their descendants, including Jesus and Job, and Jonah, and Aaron, and Solomon; and as We vouchsafed unto David a book of divine wisdom;","numberInSurah":163,"page":104,"surah_ar":"سُورَةُ النِّسَاءِ","surah_en":"An-Nisaa"},{"num":43,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ يَا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا بِالْعُقُودِ ۚ أُحِلَّتْ لَكُمْ بَهِيمَةُ الْأَنْعَامِ إِلَّا مَا يُتْلَىٰ عَلَيْكُمْ غَيْرَ مُحِلِّي الصَّيْدِ وَأَنْتُمْ حُرُمٌ ۗ إِنَّ اللَّهَ يَحْكُمُ مَا يُرِيدُ","ayah_en":"O YOU who have attained to faith! Be true to your covenants! Lawful to you is the [flesh of every] beast that feeds on plants, save what is mentioned to you [hereinafter]: but you are not allowed to hunt while you are in the state of pilgrimage. Behold, God ordains in accordance with His will.","numberInSurah":1,"page":106,"surah_ar":"سُورَةُ المَائـِدَةِ","surah_en":"Al-Maaida"},{"num":44,"ayah_ar":"۞ وَلَقَدْ أَخَذَ اللَّهُ مِيثَاقَ بَنِي إِسْرَائِيلَ وَبَعَثْنَا مِنْهُمُ اثْنَيْ عَشَرَ نَقِيبًا ۖ وَقَالَ اللَّهُ إِنِّي مَعَكُمْ ۖ لَئِنْ أَقَمْتُمُ الصَّلَاةَ وَآتَيْتُمُ الزَّكَاةَ وَآمَنْتُمْ بِرُسُلِي وَعَزَّرْتُمُوهُمْ وَأَقْرَضْتُمُ اللَّهَ قَرْضًا حَسَنًا لَأُكَفِّرَنَّ عَنْكُمْ سَيِّئَاتِكُمْ وَلَأُدْخِلَنَّكُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ ۚ فَمَنْ كَفَرَ بَعْدَ ذَٰلِكَ مِنْكُمْ فَقَدْ ضَلَّ سَوَاءَ السَّبِيلِ","ayah_en":"AND, INDEED, God accepted a [similar] solemn pledge from the children of Israel when We caused twelve of their leaders to be sent [to Canaan as spies]. And God said: \"Behold, I shall be with you! If you are constant in prayer, and spend in charity, and believe in My apostles and aid them, and offer up unto God a goodly loan, I will surely efface your bad deeds and bring you into gardens through which running waters flow. But he from among you who, after this, denies the truth, will indeed have strayed from the right path!\"","numberInSurah":12,"page":109,"surah_ar":"سُورَةُ المَائـِدَةِ","surah_en":"Al-Maaida"},{"num":45,"ayah_ar":"۞ وَاتْلُ عَلَيْهِمْ نَبَأَ ابْنَيْ آدَمَ بِالْحَقِّ إِذْ قَرَّبَا قُرْبَانًا فَتُقُبِّلَ مِنْ أَحَدِهِمَا وَلَمْ يُتَقَبَّلْ مِنَ الْآخَرِ قَالَ لَأَقْتُلَنَّكَ ۖ قَالَ إِنَّمَا يَتَقَبَّلُ اللَّهُ مِنَ الْمُتَّقِينَ","ayah_en":"AND CONVEY unto them, setting forth the truth, the story of the two sons of Adam -how each offered a sacrifice, and it was accepted from one of them whereas it was not accepted from the other. [And Cain] said: \"I will surely slay thee!\" [Abel] replied: \"Behold, God accepts only from those who are conscious of Him.","numberInSurah":27,"page":112,"surah_ar":"سُورَةُ المَائـِدَةِ","surah_en":"Al-Maaida"},{"num":46,"ayah_ar":"۞ يَا أَيُّهَا الرَّسُولُ لَا يَحْزُنْكَ الَّذِينَ يُسَارِعُونَ فِي الْكُفْرِ مِنَ الَّذِينَ قَالُوا آمَنَّا بِأَفْوَاهِهِمْ وَلَمْ تُؤْمِنْ قُلُوبُهُمْ ۛ وَمِنَ الَّذِينَ هَادُوا ۛ سَمَّاعُونَ لِلْكَذِبِ سَمَّاعُونَ لِقَوْمٍ آخَرِينَ لَمْ يَأْتُوكَ ۖ يُحَرِّفُونَ الْكَلِمَ مِنْ بَعْدِ مَوَاضِعِهِ ۖ يَقُولُونَ إِنْ أُوتِيتُمْ هَٰذَا فَخُذُوهُ وَإِنْ لَمْ تُؤْتَوْهُ فَاحْذَرُوا ۚ وَمَنْ يُرِدِ اللَّهُ فِتْنَتَهُ فَلَنْ تَمْلِكَ لَهُ مِنَ اللَّهِ شَيْئًا ۚ أُولَٰئِكَ الَّذِينَ لَمْ يُرِدِ اللَّهُ أَنْ يُطَهِّرَ قُلُوبَهُمْ ۚ لَهُمْ فِي الدُّنْيَا خِزْيٌ ۖ وَلَهُمْ فِي الْآخِرَةِ عَذَابٌ عَظِيمٌ","ayah_en":"O APOSTLE! Be not grieved by those who vie with one another in denying the truth: such as those who say with their mouths, \"We believe,\" the while their hearts do not believe; and such of the Jewish faith as eagerly listen to any falsehood, eagerly listen to other people without having come to thee [for enlightenment]. They distort the meaning of the [revealed] words, taking them out of their context, saying [to themselves], \"If such-and-such [teaching] is vouchsafed unto you, accept it; but if it is not vouchsafed unto you, be on your guard!\" [Be not grieved by them-] for if God wills anyone to be tempted to evil, thou canst in no wise prevail with God in his behalf. It is they whose hearts God is not willing to cleanse. Theirs shall be ignominy in this world, and awesome suffering in the life to come-","numberInSurah":41,"page":114,"surah_ar":"سُورَةُ المَائـِدَةِ","surah_en":"Al-Maaida"},{"num":47,"ayah_ar":"۞ يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا الْيَهُودَ وَالنَّصَارَىٰ أَوْلِيَاءَ ۘ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ ۚ وَمَنْ يَتَوَلَّهُمْ مِنْكُمْ فَإِنَّهُ مِنْهُمْ ۗ إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ","ayah_en":"O YOU who have attained to faith! Do not take the Jews and the Christians for your allies: they are but allies of one another and whoever of you allies himself with them becomes, verily, one of them; behold, God does not guide such evildoers.","numberInSurah":51,"page":117,"surah_ar":"سُورَةُ المَائـِدَةِ","surah_en":"Al-Maaida"},{"num":48,"ayah_ar":"۞ يَا أَيُّهَا الرَّسُولُ بَلِّغْ مَا أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ ۖ وَإِنْ لَمْ تَفْعَلْ فَمَا بَلَّغْتَ رِسَالَتَهُ ۚ وَاللَّهُ يَعْصِمُكَ مِنَ النَّاسِ ۗ إِنَّ اللَّهَ لَا يَهْدِي الْقَوْمَ الْكَافِرِينَ","ayah_en":"O APOSTLE! Announce all that has been bestowed from on high upon thee by thy Sustainer: for unless thou doest it fully, thou wilt not have delivered His message [at all]. And God will protect thee from [unbelieving] men: behold, God does not guide people who refuse to acknowledge the truth.","numberInSurah":67,"page":119,"surah_ar":"سُورَةُ المَائـِدَةِ","surah_en":"Al-Maaida"},{"num":49,"ayah_ar":"۞ لَتَجِدَنَّ أَشَدَّ النَّاسِ عَدَاوَةً لِلَّذِينَ آمَنُوا الْيَهُودَ وَالَّذِينَ أَشْرَكُوا ۖ وَلَتَجِدَنَّ أَقْرَبَهُمْ مَوَدَّةً لِلَّذِينَ آمَنُوا الَّذِينَ قَالُوا إِنَّا نَصَارَىٰ ۚ ذَٰلِكَ بِأَنَّ مِنْهُمْ قِسِّيسِينَ وَرُهْبَانًا وَأَنَّهُمْ لَا يَسْتَكْبِرُونَ","ayah_en":"Thou wilt surely find that, of all people, the most hostile to those who believe [in this divine writ] are the Jews as well as those who are bent on ascribing divinity to aught beside God; and thou wilt surely find that, of all people, they who say, \"Behold, we are Christians,\" come closest to feeling affection for those who believe [in this divine writ]: this is so because there are priests and monks among them, and because these are not given to arrogance.","numberInSurah":82,"page":121,"surah_ar":"سُورَةُ المَائـِدَةِ","surah_en":"Al-Maaida"},{"num":50,"ayah_ar":"۞ جَعَلَ اللَّهُ الْكَعْبَةَ الْبَيْتَ الْحَرَامَ قِيَامًا لِلنَّاسِ وَالشَّهْرَ الْحَرَامَ وَالْهَدْيَ وَالْقَلَائِدَ ۚ ذَٰلِكَ لِتَعْلَمُوا أَنَّ اللَّهَ يَعْلَمُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَأَنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ","ayah_en":"God has laid down that the Ka'bah, the Inviolable Temple, shall be a symbol for all mankind; and [so, too] the sacred month [of pilgrimage] and the garlanded offerings [are symbols] meant to make you aware that God is aware of all that is in the heavens and all that is on earth, and that God has full knowledge of everything.","numberInSurah":97,"page":124,"surah_ar":"سُورَةُ المَائـِدَةِ","surah_en":"Al-Maaida"},{"num":51,"ayah_ar":"۞ يَوْمَ يَجْمَعُ اللَّهُ الرُّسُلَ فَيَقُولُ مَاذَا أُجِبْتُمْ ۖ قَالُوا لَا عِلْمَ لَنَا ۖ إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ","ayah_en":"ON THE DAY when God shall assemble all the apostles and shall ask, \"What response did you receive?\" -they will answer, \"We have no knowledge; verily, it is Thou alone who fully knowest all the things that are beyond the reach of a created being's perception.\"","numberInSurah":109,"page":126,"surah_ar":"سُورَةُ المَائـِدَةِ","surah_en":"Al-Maaida"},{"num":52,"ayah_ar":"۞ وَلَهُ مَا سَكَنَ فِي اللَّيْلِ وَالنَّهَارِ ۚ وَهُوَ السَّمِيعُ الْعَلِيمُ","ayah_en":"although His is all that dwells in the night and the day, and He alone is all-hearing, all-knowing.","numberInSurah":13,"page":129,"surah_ar":"سُورَةُ الأَنۡعَامِ","surah_en":"Al-An'aam"},{"num":53,"ayah_ar":"۞ إِنَّمَا يَسْتَجِيبُ الَّذِينَ يَسْمَعُونَ ۘ وَالْمَوْتَىٰ يَبْعَثُهُمُ اللَّهُ ثُمَّ إِلَيْهِ يُرْجَعُونَ","ayah_en":"Only they who listen [with their hearts] can respond to a call; and as for the dead [of heart], God [alone] can raise them from the dead, whereupon unto Him they shall return.","numberInSurah":36,"page":132,"surah_ar":"سُورَةُ الأَنۡعَامِ","surah_en":"Al-An'aam"},{"num":54,"ayah_ar":"۞ وَعِنْدَهُ مَفَاتِحُ الْغَيْبِ لَا يَعْلَمُهَا إِلَّا هُوَ ۚ وَيَعْلَمُ مَا فِي الْبَرِّ وَالْبَحْرِ ۚ وَمَا تَسْقُطُ مِنْ وَرَقَةٍ إِلَّا يَعْلَمُهَا وَلَا حَبَّةٍ فِي ظُلُمَاتِ الْأَرْضِ وَلَا رَطْبٍ وَلَا يَابِسٍ إِلَّا فِي كِتَابٍ مُبِينٍ","ayah_en":"For, with Him are the keys to the things that are beyond the reach of a created being's perception: none knows them but He. And He knows all that is on land and in the sea; and not a leaf falls but He knows it; and neither is there a grain in the earth's deep darkness, nor anything: living or dead, but is recorded in [His] clear decree.","numberInSurah":59,"page":134,"surah_ar":"سُورَةُ الأَنۡعَامِ","surah_en":"Al-An'aam"},{"num":55,"ayah_ar":"۞ وَإِذْ قَالَ إِبْرَاهِيمُ لِأَبِيهِ آزَرَ أَتَتَّخِذُ أَصْنَامًا آلِهَةً ۖ إِنِّي أَرَاكَ وَقَوْمَكَ فِي ضَلَالٍ مُبِينٍ","ayah_en":"AND, LO, [thus] spoke Abraham unto his father Azar: \"Takest thou idols for gods? Verily, I see that thou and thy people have obviously gone astray!\"","numberInSurah":74,"page":137,"surah_ar":"سُورَةُ الأَنۡعَامِ","surah_en":"Al-An'aam"},{"num":56,"ayah_ar":"۞ إِنَّ اللَّهَ فَالِقُ الْحَبِّ وَالنَّوَىٰ ۖ يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَمُخْرِجُ الْمَيِّتِ مِنَ الْحَيِّ ۚ ذَٰلِكُمُ اللَّهُ ۖ فَأَنَّىٰ تُؤْفَكُونَ","ayah_en":"VERILY, God is the One who cleaves the grain and the fruit-kernel asunder, bringing forth the living out of that which is dead, and He is the One who brings forth the dead out of that which is alive. This, then, is God: and yet, how perverted are your minds!","numberInSurah":95,"page":140,"surah_ar":"سُورَةُ الأَنۡعَامِ","surah_en":"Al-An'aam"},{"num":57,"ayah_ar":"۞ وَلَوْ أَنَّنَا نَزَّلْنَا إِلَيْهِمُ الْمَلَائِكَةَ وَكَلَّمَهُمُ الْمَوْتَىٰ وَحَشَرْنَا عَلَيْهِمْ كُلَّ شَيْءٍ قُبُلًا مَا كَانُوا لِيُؤْمِنُوا إِلَّا أَنْ يَشَاءَ اللَّهُ وَلَٰكِنَّ أَكْثَرَهُمْ يَجْهَلُونَ","ayah_en":"And even if We were to send down angels unto them, and if the dead were to speak unto them and [even if] We were to assemble before them, face to face, all the things [that can prove the truth], they would still not believe unless God so willed But [of this] most of them are entirely unaware.","numberInSurah":111,"page":142,"surah_ar":"سُورَةُ الأَنۡعَامِ","surah_en":"Al-An'aam"},{"num":58,"ayah_ar":"۞ لَهُمْ دَارُ السَّلَامِ عِنْدَ رَبِّهِمْ ۖ وَهُوَ وَلِيُّهُمْ بِمَا كَانُوا يَعْمَلُونَ","ayah_en":"Theirs shall be an abode of peace with their Sustainer; and He shall be near unto them in result of what they have been doing.","numberInSurah":127,"page":144,"surah_ar":"سُورَةُ الأَنۡعَامِ","surah_en":"Al-An'aam"},{"num":59,"ayah_ar":"۞ وَهُوَ الَّذِي أَنْشَأَ جَنَّاتٍ مَعْرُوشَاتٍ وَغَيْرَ مَعْرُوشَاتٍ وَالنَّخْلَ وَالزَّرْعَ مُخْتَلِفًا أُكُلُهُ وَالزَّيْتُونَ وَالرُّمَّانَ مُتَشَابِهًا وَغَيْرَ مُتَشَابِهٍ ۚ كُلُوا مِنْ ثَمَرِهِ إِذَا أَثْمَرَ وَآتُوا حَقَّهُ يَوْمَ حَصَادِهِ ۖ وَلَا تُسْرِفُوا ۚ إِنَّهُ لَا يُحِبُّ الْمُسْرِفِينَ","ayah_en":"For it is He who has brought into being gardens-[both] the cultivated ones and those growing wild -and the date-palm, and fields bearing multiform produce, and the olive tree, and the pomegranate: [all] resembling one another and yet so different! Eat of their fruit when it comes to fruition, and give [unto the poor] their due on harvest day. And do not waste [God's bounties]: verily, He does not love the wasteful!","numberInSurah":141,"page":146,"surah_ar":"سُورَةُ الأَنۡعَامِ","surah_en":"Al-An'aam"},{"num":60,"ayah_ar":"۞ قُلْ تَعَالَوْا أَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ ۖ أَلَّا تُشْرِكُوا بِهِ شَيْئًا ۖ وَبِالْوَالِدَيْنِ إِحْسَانًا ۖ وَلَا تَقْتُلُوا أَوْلَادَكُمْ مِنْ إِمْلَاقٍ ۖ نَحْنُ نَرْزُقُكُمْ وَإِيَّاهُمْ ۖ وَلَا تَقْرَبُوا الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ ۖ وَلَا تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ ۚ ذَٰلِكُمْ وَصَّاكُمْ بِهِ لَعَلَّكُمْ تَعْقِلُونَ","ayah_en":"Say: \"Come, let me convey unto you what God has [really] forbidden to you: \"Do not ascribe divinity, in any way, to aught beside Him; and [do not offend against but, rather,] do good unto your parents; and do not kill your children for fear of poverty - [for] it is We who shall provide sustenance for you as well as for them; and do not commit any shameful deeds, be they open or secret; and do not take any human being's life-[the life] which God has declared to be sacred -otherwise than in [the pursuit of] justice: this has He enjoined upon you so that you might use your reason;","numberInSurah":151,"page":148,"surah_ar":"سُورَةُ الأَنۡعَامِ","surah_en":"Al-An'aam"},{"num":61,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ المص","ayah_en":"Alif. Lam. Mim. Sad.","numberInSurah":1,"page":151,"surah_ar":"سُورَةُ الأَعۡرَافِ","surah_en":"Al-A'raaf"},{"num":62,"ayah_ar":"۞ يَا بَنِي آدَمَ خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ وَكُلُوا وَاشْرَبُوا وَلَا تُسْرِفُوا ۚ إِنَّهُ لَا يُحِبُّ الْمُسْرِفِينَ","ayah_en":"O CHILDREN of Adam! Beautify yourselves for every act of worship, and eat and drink [freely], but do not waste: verily, He does not love the wasteful!","numberInSurah":31,"page":154,"surah_ar":"سُورَةُ الأَعۡرَافِ","surah_en":"Al-A'raaf"},{"num":63,"ayah_ar":"۞ وَإِذَا صُرِفَتْ أَبْصَارُهُمْ تِلْقَاءَ أَصْحَابِ النَّارِ قَالُوا رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ","ayah_en":"And whenever their eyes are turned towards the inmates of the fire, they will cry: \"O our Sustainer! Place us not among the people who have been guilty of evildoing!\"","numberInSurah":47,"page":156,"surah_ar":"سُورَةُ الأَعۡرَافِ","surah_en":"Al-A'raaf"},{"num":64,"ayah_ar":"۞ وَإِلَىٰ عَادٍ أَخَاهُمْ هُودًا ۗ قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَٰهٍ غَيْرُهُ ۚ أَفَلَا تَتَّقُونَ","ayah_en":"AND UNTO [the tribe of] `Ad [We sent] their brother Hud. He said: \"O my people! Worship God alone: you have no deity other than Him. Will you not, then, be conscious of Him?\"","numberInSurah":65,"page":158,"surah_ar":"سُورَةُ الأَعۡرَافِ","surah_en":"Al-A'raaf"},{"num":65,"ayah_ar":"۞ قَالَ الْمَلَأُ الَّذِينَ اسْتَكْبَرُوا مِنْ قَوْمِهِ لَنُخْرِجَنَّكَ يَا شُعَيْبُ وَالَّذِينَ آمَنُوا مَعَكَ مِنْ قَرْيَتِنَا أَوْ لَتَعُودُنَّ فِي مِلَّتِنَا ۚ قَالَ أَوَلَوْ كُنَّا كَارِهِينَ","ayah_en":"Said the great ones among his people, who gloried in their arrogance: \"Most certainly, O Shu'ayb, we shall expel thee and thy fellow-believers from our land, unless you indeed return to our ways!\" Said [Shu'ayb]: \"Why, even though we abhor [them]?","numberInSurah":88,"page":162,"surah_ar":"سُورَةُ الأَعۡرَافِ","surah_en":"Al-A'raaf"},{"num":66,"ayah_ar":"۞ وَأَوْحَيْنَا إِلَىٰ مُوسَىٰ أَنْ أَلْقِ عَصَاكَ ۖ فَإِذَا هِيَ تَلْقَفُ مَا يَأْفِكُونَ","ayah_en":"And [then] We inspired Moses, \"Throw down thy staff!\" -and lo! it swallowed up all their deceptions:","numberInSurah":117,"page":164,"surah_ar":"سُورَةُ الأَعۡرَافِ","surah_en":"Al-A'raaf"},{"num":67,"ayah_ar":"۞ وَوَاعَدْنَا مُوسَىٰ ثَلَاثِينَ لَيْلَةً وَأَتْمَمْنَاهَا بِعَشْرٍ فَتَمَّ مِيقَاتُ رَبِّهِ أَرْبَعِينَ لَيْلَةً ۚ وَقَالَ مُوسَىٰ لِأَخِيهِ هَارُونَ اخْلُفْنِي فِي قَوْمِي وَأَصْلِحْ وَلَا تَتَّبِعْ سَبِيلَ الْمُفْسِدِينَ","ayah_en":"AND [then] We appointed for Moses thirty nights [on Mount Sinai]; and We added to them ten, whereby the term of forty nights set bye, his Sustainer was fulfilled. And Moses said unto his brother Aaron: \"Take thou my place among my people; and act righteously, and follow not the path of the spreaders of corruption.\"","numberInSurah":142,"page":167,"surah_ar":"سُورَةُ الأَعۡرَافِ","surah_en":"Al-A'raaf"},{"num":68,"ayah_ar":"۞ وَاكْتُبْ لَنَا فِي هَٰذِهِ الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ إِنَّا هُدْنَا إِلَيْكَ ۚ قَالَ عَذَابِي أُصِيبُ بِهِ مَنْ أَشَاءُ ۖ وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ ۚ فَسَأَكْتُبُهَا لِلَّذِينَ يَتَّقُونَ وَيُؤْتُونَ الزَّكَاةَ وَالَّذِينَ هُمْ بِآيَاتِنَا يُؤْمِنُونَ","ayah_en":"And ordain Thou for us what is good in this world as well as in the life to come: behold, unto Thee have we turned in repentance!\" [God] answered: \"With My chastisement do I afflict whom I will - but My grace overspreads everything: and so I shall confer it on those who are conscious of Me and spend in charity, and who believe in Our messages-","numberInSurah":156,"page":170,"surah_ar":"سُورَةُ الأَعۡرَافِ","surah_en":"Al-A'raaf"},{"num":69,"ayah_ar":"۞ وَإِذْ نَتَقْنَا الْجَبَلَ فَوْقَهُمْ كَأَنَّهُ ظُلَّةٌ وَظَنُّوا أَنَّهُ وَاقِعٌ بِهِمْ خُذُوا مَا آتَيْنَاكُمْ بِقُوَّةٍ وَاذْكُرُوا مَا فِيهِ لَعَلَّكُمْ تَتَّقُونَ","ayah_en":"And [did We not say,] when We caused Mount Sinai to quake above the children of Israel as though it were a [mere] shadow, and they thought that it would fall upon them, \"Hold fast with [all your] strength unto what We have vouchsafed you, and bear in mind all that is therein, so that you might remain conscious of God\"?","numberInSurah":171,"page":173,"surah_ar":"سُورَةُ الأَعۡرَافِ","surah_en":"Al-A'raaf"},{"num":70,"ayah_ar":"۞ هُوَ الَّذِي خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ وَجَعَلَ مِنْهَا زَوْجَهَا لِيَسْكُنَ إِلَيْهَا ۖ فَلَمَّا تَغَشَّاهَا حَمَلَتْ حَمْلًا خَفِيفًا فَمَرَّتْ بِهِ ۖ فَلَمَّا أَثْقَلَتْ دَعَوَا اللَّهَ رَبَّهُمَا لَئِنْ آتَيْتَنَا صَالِحًا لَنَكُونَنَّ مِنَ الشَّاكِرِينَ","ayah_en":"IT IS HE who has created you [all] out of one living entity, and out of it brought into being its mate, so that man might incline [with love] towards woman. And so, when he has embraced her, she conceives [what at first is] a light burden, and continues to bear it. Then, when she grows heavy [with child], they both call unto God, their Sustainer, \"If Thou indeed grant us a sound [child], we shall most certainly be among the grateful!\"","numberInSurah":189,"page":175,"surah_ar":"سُورَةُ الأَعۡرَافِ","surah_en":"Al-A'raaf"},{"num":71,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ يَسْأَلُونَكَ عَنِ الْأَنْفَالِ ۖ قُلِ الْأَنْفَالُ لِلَّهِ وَالرَّسُولِ ۖ فَاتَّقُوا اللَّهَ وَأَصْلِحُوا ذَاتَ بَيْنِكُمْ ۖ وَأَطِيعُوا اللَّهَ وَرَسُولَهُ إِنْ كُنْتُمْ مُؤْمِنِينَ","ayah_en":"HEY WILL ASK thee about the spoils of war. Say: \"All spoils of war belong to God and the Apostle.\" Remain, then, conscious of God, and keep alive the bonds of brotherhood among yourselves, and pay heed unto God and His Apostle, if you are [truly] believers!","numberInSurah":1,"page":177,"surah_ar":"سُورَةُ الأَنفَالِ","surah_en":"Al-Anfaal"},{"num":72,"ayah_ar":"۞ إِنَّ شَرَّ الدَّوَابِّ عِنْدَ اللَّهِ الصُّمُّ الْبُكْمُ الَّذِينَ لَا يَعْقِلُونَ","ayah_en":"Verily, the vilest of all creatures in the sight of God are those deaf, those dumb ones who do not use their reason.","numberInSurah":22,"page":179,"surah_ar":"سُورَةُ الأَنفَالِ","surah_en":"Al-Anfaal"},{"num":73,"ayah_ar":"۞ وَاعْلَمُوا أَنَّمَا غَنِمْتُمْ مِنْ شَيْءٍ فَأَنَّ لِلَّهِ خُمُسَهُ وَلِلرَّسُولِ وَلِذِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ إِنْ كُنْتُمْ آمَنْتُمْ بِاللَّهِ وَمَا أَنْزَلْنَا عَلَىٰ عَبْدِنَا يَوْمَ الْفُرْقَانِ يَوْمَ الْتَقَى الْجَمْعَانِ ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","ayah_en":"AND KNOW that whatever booty you acquire [in war], one-fifth thereof belongs to God and the Apostle, and the near of kin, and the orphans, and the needy, and the wayfarer. [This you must observe] if you believe in God and in what We bestowed from on high upon Our servant on the day when the true was distinguished from the false - the day when the two hosts met in battle. And God has the power to will anything.","numberInSurah":41,"page":182,"surah_ar":"سُورَةُ الأَنفَالِ","surah_en":"Al-Anfaal"},{"num":74,"ayah_ar":"۞ وَإِنْ جَنَحُوا لِلسَّلْمِ فَاجْنَحْ لَهَا وَتَوَكَّلْ عَلَى اللَّهِ ۚ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ","ayah_en":"But if they incline to peace, incline thou to it as well, and place thy trust in God: verily, He alone is all-hearing, all-knowing!","numberInSurah":61,"page":184,"surah_ar":"سُورَةُ الأَنفَالِ","surah_en":"Al-Anfaal"},{"num":75,"ayah_ar":"بَرَاءَةٌ مِنَ اللَّهِ وَرَسُولِهِ إِلَى الَّذِينَ عَاهَدْتُمْ مِنَ الْمُشْرِكِينَ","ayah_en":"DISAVOWAL by God and His Apostle [is herewith announced] unto those who ascribe divinity to aught beside God, [and] with whom you [O: believers] have made a covenant.","numberInSurah":1,"page":187,"surah_ar":"سُورَةُ التَّوۡبَةِ","surah_en":"At-Tawba"},{"num":76,"ayah_ar":"۞ أَجَعَلْتُمْ سِقَايَةَ الْحَاجِّ وَعِمَارَةَ الْمَسْجِدِ الْحَرَامِ كَمَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَجَاهَدَ فِي سَبِيلِ اللَّهِ ۚ لَا يَسْتَوُونَ عِنْدَ اللَّهِ ۗ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ","ayah_en":"Do you, perchance, regard the [mere] giving of water to pilgrims and the tending of the Inviolable House of Worship as being equal to [the works of] one who believes in God and the Last Day and strives hard in God's cause? These [things] are not equal in the sight of God. And God does not grace with His guidance people who [deliberately] do wrong.","numberInSurah":19,"page":189,"surah_ar":"سُورَةُ التَّوۡبَةِ","surah_en":"At-Tawba"},{"num":77,"ayah_ar":"۞ يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّ كَثِيرًا مِنَ الْأَحْبَارِ وَالرُّهْبَانِ لَيَأْكُلُونَ أَمْوَالَ النَّاسِ بِالْبَاطِلِ وَيَصُدُّونَ عَنْ سَبِيلِ اللَّهِ ۗ وَالَّذِينَ يَكْنِزُونَ الذَّهَبَ وَالْفِضَّةَ وَلَا يُنْفِقُونَهَا فِي سَبِيلِ اللَّهِ فَبَشِّرْهُمْ بِعَذَابٍ أَلِيمٍ","ayah_en":"O you who have attained to faith! Behold, many of the rabbis and monks do indeed wrongfully devour men's possessions and turn [others] away from the path of God. But as for all who lay up treasures of gold and silver and do not spend them for the sake of God - give them the tiding of grievous suffering [in the life to come]:","numberInSurah":34,"page":192,"surah_ar":"سُورَةُ التَّوۡبَةِ","surah_en":"At-Tawba"},{"num":78,"ayah_ar":"۞ وَلَوْ أَرَادُوا الْخُرُوجَ لَأَعَدُّوا لَهُ عُدَّةً وَلَٰكِنْ كَرِهَ اللَّهُ انْبِعَاثَهُمْ فَثَبَّطَهُمْ وَقِيلَ اقْعُدُوا مَعَ الْقَاعِدِينَ","ayah_en":"For, had they been [truly] desirous of setting out [with thee], they would surely have made some preparation therefor: but God was averse to their taking the field, and so He caused them to hold back when it was said, \"[You may] stay at home with all [the others] who stay at home.\"","numberInSurah":46,"page":194,"surah_ar":"سُورَةُ التَّوۡبَةِ","surah_en":"At-Tawba"},{"num":79,"ayah_ar":"۞ إِنَّمَا الصَّدَقَاتُ لِلْفُقَرَاءِ وَالْمَسَاكِينِ وَالْعَامِلِينَ عَلَيْهَا وَالْمُؤَلَّفَةِ قُلُوبُهُمْ وَفِي الرِّقَابِ وَالْغَارِمِينَ وَفِي سَبِيلِ اللَّهِ وَابْنِ السَّبِيلِ ۖ فَرِيضَةً مِنَ اللَّهِ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ","ayah_en":"The offerings given for the sake of God are [meant] only for the poor and the needy, and those who are in charge thereof, and those whose hearts are to be won over, and for the freeing of human beings from bondage, and [for] those who are over burdened with debts, and [for every struggle] in God's cause, and [for] the wayfarer: [this is] an ordinance from God - and God is all-knowing, wise.","numberInSurah":60,"page":196,"surah_ar":"سُورَةُ التَّوۡبَةِ","surah_en":"At-Tawba"},{"num":80,"ayah_ar":"۞ وَمِنْهُمْ مَنْ عَاهَدَ اللَّهَ لَئِنْ آتَانَا مِنْ فَضْلِهِ لَنَصَّدَّقَنَّ وَلَنَكُونَنَّ مِنَ الصَّالِحِينَ","ayah_en":"And among them are such as vow unto God, \"If indeed He grant us [something] out of His bounty, we shall most certainly spend in charity, and shall most certainly be among the righteous!\"","numberInSurah":75,"page":199,"surah_ar":"سُورَةُ التَّوۡبَةِ","surah_en":"At-Tawba"},{"num":81,"ayah_ar":"۞ إِنَّمَا السَّبِيلُ عَلَى الَّذِينَ يَسْتَأْذِنُونَكَ وَهُمْ أَغْنِيَاءُ ۚ رَضُوا بِأَنْ يَكُونُوا مَعَ الْخَوَالِفِ وَطَبَعَ اللَّهُ عَلَىٰ قُلُوبِهِمْ فَهُمْ لَا يَعْلَمُونَ","ayah_en":"Only they may rightly be reproached who asked thee for exemption even though they were fully able [to go to war]. They were well-pleased to remain with those who were left behind -wherefore God has sealed their hearts, so that they do not know [what they are doing].","numberInSurah":93,"page":201,"surah_ar":"سُورَةُ التَّوۡبَةِ","surah_en":"At-Tawba"},{"num":82,"ayah_ar":"۞ إِنَّ اللَّهَ اشْتَرَىٰ مِنَ الْمُؤْمِنِينَ أَنْفُسَهُمْ وَأَمْوَالَهُمْ بِأَنَّ لَهُمُ الْجَنَّةَ ۚ يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ فَيَقْتُلُونَ وَيُقْتَلُونَ ۖ وَعْدًا عَلَيْهِ حَقًّا فِي التَّوْرَاةِ وَالْإِنْجِيلِ وَالْقُرْآنِ ۚ وَمَنْ أَوْفَىٰ بِعَهْدِهِ مِنَ اللَّهِ ۚ فَاسْتَبْشِرُوا بِبَيْعِكُمُ الَّذِي بَايَعْتُمْ بِهِ ۚ وَذَٰلِكَ هُوَ الْفَوْزُ الْعَظِيمُ","ayah_en":"BEHOLD, God has bought of the believers their lives and their possessions, promising them paradise in return, [and so] they fight in God's cause, and slay, and are slain: a promise which in truth He has willed upon Himself in [the words of] the Torah, and the Gospel, and the Qur'an. And who could be more faithful to his covenant than God? Rejoice, then, in the bargain which you have made with Him: for this, this is the triumph supreme!","numberInSurah":111,"page":204,"surah_ar":"سُورَةُ التَّوۡبَةِ","surah_en":"At-Tawba"},{"num":83,"ayah_ar":"۞ وَمَا كَانَ الْمُؤْمِنُونَ لِيَنْفِرُوا كَافَّةً ۚ فَلَوْلَا نَفَرَ مِنْ كُلِّ فِرْقَةٍ مِنْهُمْ طَائِفَةٌ لِيَتَفَقَّهُوا فِي الدِّينِ وَلِيُنْذِرُوا قَوْمَهُمْ إِذَا رَجَعُوا إِلَيْهِمْ لَعَلَّهُمْ يَحْذَرُونَ","ayah_en":"With all this, it is not desirable that all of the believers take the field [in time of war]. From within every group in their midst, some shall refrain from going forth to war, and shall devote themselves [instead] to acquiring a deeper knowledge of the Faith. and [thus be able to] teach their home-coming brethren, so that these [too] might guard themselves against evil.","numberInSurah":122,"page":206,"surah_ar":"سُورَةُ التَّوۡبَةِ","surah_en":"At-Tawba"},{"num":84,"ayah_ar":"۞ وَلَوْ يُعَجِّلُ اللَّهُ لِلنَّاسِ الشَّرَّ اسْتِعْجَالَهُمْ بِالْخَيْرِ لَقُضِيَ إِلَيْهِمْ أَجَلُهُمْ ۖ فَنَذَرُ الَّذِينَ لَا يَرْجُونَ لِقَاءَنَا فِي طُغْيَانِهِمْ يَعْمَهُونَ","ayah_en":"NOW IF GOD were to hasten for human beings the ill [which they deserve by their sinning] in the same manner as they [themselves] would hasten [the coming to them of what they consider to be] good, their end would indeed come forthwith! But We leave them alone [for a while] -all those who do not believe that they are destined to meet Us: [We leave them alone] in their overweening arrogance, blindly stumbling to and fro.","numberInSurah":11,"page":209,"surah_ar":"سُورَةُ يُونُسَ","surah_en":"Yunus"},{"num":85,"ayah_ar":"۞ لِلَّذِينَ أَحْسَنُوا الْحُسْنَىٰ وَزِيَادَةٌ ۖ وَلَا يَرْهَقُ وُجُوهَهُمْ قَتَرٌ وَلَا ذِلَّةٌ ۚ أُولَٰئِكَ أَصْحَابُ الْجَنَّةِ ۖ هُمْ فِيهَا خَالِدُونَ","ayah_en":"For those who persevere in doing good there is the ultimate good in store, and more [than that]. No darkness and no ignominy will overshadow their faces [on Resurrection Day]: it is they who are destined for paradise, therein to abide.","numberInSurah":26,"page":212,"surah_ar":"سُورَةُ يُونُسَ","surah_en":"Yunus"},{"num":86,"ayah_ar":"۞ وَيَسْتَنْبِئُونَكَ أَحَقٌّ هُوَ ۖ قُلْ إِي وَرَبِّي إِنَّهُ لَحَقٌّ ۖ وَمَا أَنْتُمْ بِمُعْجِزِينَ","ayah_en":"And some people ask thee, \"Is all this true?\" Say: \"Yea, by my Sustainer! It is most certainly true, and you cannot elude [the final reckoning]!\"","numberInSurah":53,"page":214,"surah_ar":"سُورَةُ يُونُسَ","surah_en":"Yunus"},{"num":87,"ayah_ar":"۞ وَاتْلُ عَلَيْهِمْ نَبَأَ نُوحٍ إِذْ قَالَ لِقَوْمِهِ يَا قَوْمِ إِنْ كَانَ كَبُرَ عَلَيْكُمْ مَقَامِي وَتَذْكِيرِي بِآيَاتِ اللَّهِ فَعَلَى اللَّهِ تَوَكَّلْتُ فَأَجْمِعُوا أَمْرَكُمْ وَشُرَكَاءَكُمْ ثُمَّ لَا يَكُنْ أَمْرُكُمْ عَلَيْكُمْ غُمَّةً ثُمَّ اقْضُوا إِلَيَّ وَلَا تُنْظِرُونِ","ayah_en":"AND CONVEY unto them the story of Noah-when he said unto his people: \"O my people! If my presence [among you] and my announcement of God's messages are repugnant to you -well, in God have I placed my trust. Decide, then, upon what you are going to do [against me], and [call to your aid] those beings to whom you ascribe a share in God's divinity; and once you have chosen your course of action, let no hesitation deflect you from it; and then carry out against me [whatever you may have decided], and give me no respite!","numberInSurah":71,"page":217,"surah_ar":"سُورَةُ يُونُسَ","surah_en":"Yunus"},{"num":88,"ayah_ar":"۞ وَجَاوَزْنَا بِبَنِي إِسْرَائِيلَ الْبَحْرَ فَأَتْبَعَهُمْ فِرْعَوْنُ وَجُنُودُهُ بَغْيًا وَعَدْوًا ۖ حَتَّىٰ إِذَا أَدْرَكَهُ الْغَرَقُ قَالَ آمَنْتُ أَنَّهُ لَا إِلَٰهَ إِلَّا الَّذِي آمَنَتْ بِهِ بَنُو إِسْرَائِيلَ وَأَنَا مِنَ الْمُسْلِمِينَ","ayah_en":"And We brought the children of Israel across the sea; and thereupon Pharaoh and his hosts pursued them with vehement insolence and tyranny, until [they were overwhelmed by the waters of the sea. And] when he was about to drown, [Pharaoh] exclaimed: \"I have come to believe that there is no deity save Him in whom the children of Israel believe, and I am of those who surrender themselves unto Him!\"","numberInSurah":90,"page":219,"surah_ar":"سُورَةُ يُونُسَ","surah_en":"Yunus"},{"num":89,"ayah_ar":"۞ وَمَا مِنْ دَابَّةٍ فِي الْأَرْضِ إِلَّا عَلَى اللَّهِ رِزْقُهَا وَيَعْلَمُ مُسْتَقَرَّهَا وَمُسْتَوْدَعَهَا ۚ كُلٌّ فِي كِتَابٍ مُبِينٍ","ayah_en":"And there is no living creature on earth but depends for its sustenance on God; and He knows its time-limit [on earth] and its resting-place [after death]: all [this] is laid down in [His] clear decree.","numberInSurah":6,"page":222,"surah_ar":"سُورَةُ هُودٍ","surah_en":"Hud"},{"num":90,"ayah_ar":"۞ مَثَلُ الْفَرِيقَيْنِ كَالْأَعْمَىٰ وَالْأَصَمِّ وَالْبَصِيرِ وَالسَّمِيعِ ۚ هَلْ يَسْتَوِيَانِ مَثَلًا ۚ أَفَلَا تَذَكَّرُونَ","ayah_en":"These two kinds of man may be likened to the blind and deaf and the seeing and hearing. Can these two be deemed alike in [their] nature? ` Will you not, then, keep this in mind?","numberInSurah":24,"page":224,"surah_ar":"سُورَةُ هُودٍ","surah_en":"Hud"},{"num":91,"ayah_ar":"۞ وَقَالَ ارْكَبُوا فِيهَا بِسْمِ اللَّهِ مَجْرَاهَا وَمُرْسَاهَا ۚ إِنَّ رَبِّي لَغَفُورٌ رَحِيمٌ","ayah_en":"So he said [unto his followers]: \"Embark in this [ship]! In the name of God be its run and its riding at anchor! Behold, my. Sustainer is indeed much-forgiving, a dispenser of grace!\"","numberInSurah":41,"page":226,"surah_ar":"سُورَةُ هُودٍ","surah_en":"Hud"},{"num":92,"ayah_ar":"۞ وَإِلَىٰ ثَمُودَ أَخَاهُمْ صَالِحًا ۚ قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَٰهٍ غَيْرُهُ ۖ هُوَ أَنْشَأَكُمْ مِنَ الْأَرْضِ وَاسْتَعْمَرَكُمْ فِيهَا فَاسْتَغْفِرُوهُ ثُمَّ تُوبُوا إِلَيْهِ ۚ إِنَّ رَبِّي قَرِيبٌ مُجِيبٌ","ayah_en":"AND UNTO [the tribe of] Thamud [We sent] their brother Salih. He said: \"O my people! Worship God [alone]: you have no deity other than Him. He brought you into being out of the earth, and made you thrive thereon. Ask Him, therefore, to forgive you your sins, and then turn towards Him in repentance-for, verily, my Sustainer is ever-near, responding [to the call of whoever calls unto Him]!\"","numberInSurah":61,"page":228,"surah_ar":"سُورَةُ هُودٍ","surah_en":"Hud"},{"num":93,"ayah_ar":"۞ وَإِلَىٰ مَدْيَنَ أَخَاهُمْ شُعَيْبًا ۚ قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَٰهٍ غَيْرُهُ ۖ وَلَا تَنْقُصُوا الْمِكْيَالَ وَالْمِيزَانَ ۚ إِنِّي أَرَاكُمْ بِخَيْرٍ وَإِنِّي أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ مُحِيطٍ","ayah_en":"AND UNTO [the people of] Madyan [We sent] their brother Shu'ayb. He said: \"O my people! Worship God [alone]: you have no deity other than Him; and do not give short measure and weight [in any of your dealings with men]. Behold, I see you [now] in a happy state; but, verily, I dread lest suffering befall you on a Day that will encompass [you with doom]!","numberInSurah":84,"page":231,"surah_ar":"سُورَةُ هُودٍ","surah_en":"Hud"},{"num":94,"ayah_ar":"۞ وَأَمَّا الَّذِينَ سُعِدُوا فَفِي الْجَنَّةِ خَالِدِينَ فِيهَا مَا دَامَتِ السَّمَاوَاتُ وَالْأَرْضُ إِلَّا مَا شَاءَ رَبُّكَ ۖ عَطَاءً غَيْرَ مَجْذُوذٍ","ayah_en":"But as for those who [by virtue of their past deeds] will have been blest with happiness, [they shall live] in paradise, therein to abide as long as the heavens and the earth endure -unless thy Sustainer wills it otherwise -as a gift unceasing.","numberInSurah":108,"page":233,"surah_ar":"سُورَةُ هُودٍ","surah_en":"Hud"},{"num":95,"ayah_ar":"۞ لَقَدْ كَانَ فِي يُوسُفَ وَإِخْوَتِهِ آيَاتٌ لِلسَّائِلِينَ","ayah_en":"Indeed, in [the story of] Joseph and his brothers there are messages for all who search [after truth].","numberInSurah":7,"page":236,"surah_ar":"سُورَةُ يُوسُفَ","surah_en":"Yusuf"},{"num":96,"ayah_ar":"۞ وَقَالَ نِسْوَةٌ فِي الْمَدِينَةِ امْرَأَتُ الْعَزِيزِ تُرَاوِدُ فَتَاهَا عَنْ نَفْسِهِ ۖ قَدْ شَغَفَهَا حُبًّا ۖ إِنَّا لَنَرَاهَا فِي ضَلَالٍ مُبِينٍ","ayah_en":"NOW the women of the city spoke [thus to one another]: \"The wife of this nobleman is trying to induce her slave-boy to yield himself unto her! Her love for him has pierced her heart; verily, we see that she is undoubtedly suffering from an aberration!","numberInSurah":30,"page":238,"surah_ar":"سُورَةُ يُوسُفَ","surah_en":"Yusuf"},{"num":97,"ayah_ar":"۞ وَمَا أُبَرِّئُ نَفْسِي ۚ إِنَّ النَّفْسَ لَأَمَّارَةٌ بِالسُّوءِ إِلَّا مَا رَحِمَ رَبِّي ۚ إِنَّ رَبِّي غَفُورٌ رَحِيمٌ","ayah_en":"And yet, I am not trying to absolve myself: for, verily, man's inner self does incite [him] to evil, and saved are only they upon whom my Sustainer bestows His grace. Behold, my Sustainer is much forgiving, a dispenser of grace!\"","numberInSurah":53,"page":242,"surah_ar":"سُورَةُ يُوسُفَ","surah_en":"Yusuf"},{"num":98,"ayah_ar":"۞ قَالُوا إِنْ يَسْرِقْ فَقَدْ سَرَقَ أَخٌ لَهُ مِنْ قَبْلُ ۚ فَأَسَرَّهَا يُوسُفُ فِي نَفْسِهِ وَلَمْ يُبْدِهَا لَهُمْ ۚ قَالَ أَنْتُمْ شَرٌّ مَكَانًا ۖ وَاللَّهُ أَعْلَمُ بِمَا تَصِفُونَ","ayah_en":"[As soon as the cup came to light out of Benjamin's bag, the brothers] exclaimed: \"If he has stolen-well, a brother of his used to steal afore-time!\" Thereupon Joseph said to himself, without revealing his thought to them: \"You are far worse in this respect, and God is fully aware of what you are saying.","numberInSurah":77,"page":244,"surah_ar":"سُورَةُ يُوسُفَ","surah_en":"Yusuf"},{"num":99,"ayah_ar":"۞ رَبِّ قَدْ آتَيْتَنِي مِنَ الْمُلْكِ وَعَلَّمْتَنِي مِنْ تَأْوِيلِ الْأَحَادِيثِ ۚ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنْتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ","ayah_en":"\"O my Sustainer! Thou hast indeed bestowed upon me something of power, and hast imparted unto me some knowledge of the inner meaning of happenings. Originator of the heavens and the earth! Thou art near unto me in this world and in the life to come: let me die as one who has surrendered himself unto Thee, and make me one with the righteous!\"","numberInSurah":101,"page":247,"surah_ar":"سُورَةُ يُوسُفَ","surah_en":"Yusuf"},{"num":100,"ayah_ar":"۞ وَإِنْ تَعْجَبْ فَعَجَبٌ قَوْلُهُمْ أَإِذَا كُنَّا تُرَابًا أَإِنَّا لَفِي خَلْقٍ جَدِيدٍ ۗ أُولَٰئِكَ الَّذِينَ كَفَرُوا بِرَبِّهِمْ ۖ وَأُولَٰئِكَ الْأَغْلَالُ فِي أَعْنَاقِهِمْ ۖ وَأُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ","ayah_en":"BUT IF thou art amazed [at the marvels of God's creation], amazing, too, is their saying, \"What! After we have become dust, shall we indeed be [restored to life] in a new act of creation?\" It is they who [thus show that they] are bent on denying their Sustainer; and it is they who carry the shackles [of their own making] around their necks; and it is they who are destined for the fire, therein to abide.","numberInSurah":5,"page":249,"surah_ar":"سُورَةُ الرَّعۡدِ","surah_en":"Ar-Ra'd"},{"num":101,"ayah_ar":"۞ أَفَمَنْ يَعْلَمُ أَنَّمَا أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ الْحَقُّ كَمَنْ هُوَ أَعْمَىٰ ۚ إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ","ayah_en":"CAN, THEN, he who knows that whatever has been bestowed from on high upon thee by thy Sustainer is the truth be deemed equal to one who is blind? Only they who are endowed with insight keep this in mind:","numberInSurah":19,"page":252,"surah_ar":"سُورَةُ الرَّعۡدِ","surah_en":"Ar-Ra'd"},{"num":102,"ayah_ar":"۞ مَثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ ۖ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ ۖ أُكُلُهَا دَائِمٌ وَظِلُّهَا ۚ تِلْكَ عُقْبَى الَّذِينَ اتَّقَوْا ۖ وَعُقْبَى الْكَافِرِينَ النَّارُ","ayah_en":"THE PARABLE of the paradise promised to those who are conscious of God [is that of a garden] through which running waters flow: [but, unlike an earthly garden,] its fruits will be everlasting, and [so will be] its shade. Such will be the destiny of those who remain conscious of God-just as the destiny of those who deny the truth will be the fire.","numberInSurah":35,"page":254,"surah_ar":"سُورَةُ الرَّعۡدِ","surah_en":"Ar-Ra'd"},{"num":103,"ayah_ar":"۞ قَالَتْ رُسُلُهُمْ أَفِي اللَّهِ شَكٌّ فَاطِرِ السَّمَاوَاتِ وَالْأَرْضِ ۖ يَدْعُوكُمْ لِيَغْفِرَ لَكُمْ مِنْ ذُنُوبِكُمْ وَيُؤَخِّرَكُمْ إِلَىٰ أَجَلٍ مُسَمًّى ۚ قَالُوا إِنْ أَنْتُمْ إِلَّا بَشَرٌ مِثْلُنَا تُرِيدُونَ أَنْ تَصُدُّونَا عَمَّا كَانَ يَعْبُدُ آبَاؤُنَا فَأْتُونَا بِسُلْطَانٍ مُبِينٍ","ayah_en":"Said the apostles sent unto them: \"Can there be any doubt about [the existence and oneness of] God, the Originator of the heavens and the earth? It is He who calls unto you, so that He may forgive you [whatever is past] of your sins and grant you respite until a term [set by Him is fulfilled].\" [But] they replied: \"You are nothing but mortal men like ourselves! You want to turn us away from what our forefathers were wont to worship: well, then, bring us a clear proof [of your being God's message-bearers]!\"","numberInSurah":10,"page":256,"surah_ar":"سُورَةُ إِبۡرَاهِيمَ","surah_en":"Ibrahim"},{"num":104,"ayah_ar":"۞ أَلَمْ تَرَ إِلَى الَّذِينَ بَدَّلُوا نِعْمَتَ اللَّهِ كُفْرًا وَأَحَلُّوا قَوْمَهُمْ دَارَ الْبَوَارِ","ayah_en":"ART THOU NOT aware of those who have preferred a denial of the truth to God's blessings, and [thereby] invited their people to alight in that abode of utter desolation","numberInSurah":28,"page":259,"surah_ar":"سُورَةُ إِبۡرَاهِيمَ","surah_en":"Ibrahim"},{"num":105,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ الر ۚ تِلْكَ آيَاتُ الْكِتَابِ وَقُرْآنٍ مُبِينٍ","ayah_en":"Alif. Lam. Ra. THESE ARE MESSAGES of revelation -of a discourse clear in itself and clearly showing the truth.","numberInSurah":1,"page":262,"surah_ar":"سُورَةُ الحِجۡرِ","surah_en":"Al-Hijr"},{"num":106,"ayah_ar":"وَأَنَّ عَذَابِي هُوَ الْعَذَابُ الْأَلِيمُ","ayah_en":"and [also,] that the suffering which I shall impose [on sinners] will indeed be a suffering most grievous.","numberInSurah":50,"page":264,"surah_ar":"سُورَةُ الحِجۡرِ","surah_en":"Al-Hijr"},{"num":107,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ أَتَىٰ أَمْرُ اللَّهِ فَلَا تَسْتَعْجِلُوهُ ۚ سُبْحَانَهُ وَتَعَالَىٰ عَمَّا يُشْرِكُونَ","ayah_en":"GOD'S JUDGMENT is [bound to] come: do not, therefore, call for its speedy advent! Limitless is He in His glory and sublimely exalted above anything to which men may ascribe a share in His divinity!","numberInSurah":1,"page":267,"surah_ar":"سُورَةُ النَّحۡلِ","surah_en":"An-Nahl"},{"num":108,"ayah_ar":"۞ وَقِيلَ لِلَّذِينَ اتَّقَوْا مَاذَا أَنْزَلَ رَبُّكُمْ ۚ قَالُوا خَيْرًا ۗ لِلَّذِينَ أَحْسَنُوا فِي هَٰذِهِ الدُّنْيَا حَسَنَةٌ ۚ وَلَدَارُ الْآخِرَةِ خَيْرٌ ۚ وَلَنِعْمَ دَارُ الْمُتَّقِينَ","ayah_en":"But [when] those who are conscious of God are asked, \"What is it that your Sustainer has bestowed from on high?\" -they answer, \"Goodness supreme!\" Good fortune awaits, in this world, all who persevere in doing good; but their ultimate state will be far better still: for, how excellent indeed will be the state of the God-conscious [in the life to come]!","numberInSurah":30,"page":270,"surah_ar":"سُورَةُ النَّحۡلِ","surah_en":"An-Nahl"},{"num":109,"ayah_ar":"۞ وَقَالَ اللَّهُ لَا تَتَّخِذُوا إِلَٰهَيْنِ اثْنَيْنِ ۖ إِنَّمَا هُوَ إِلَٰهٌ وَاحِدٌ ۖ فَإِيَّايَ فَارْهَبُونِ","ayah_en":"And God has said: \"Do not take to worshipping two [or more] deities. He is the One and Only God: hence, of Me, of Me alone stand in awe!\"","numberInSurah":51,"page":272,"surah_ar":"سُورَةُ النَّحۡلِ","surah_en":"An-Nahl"},{"num":110,"ayah_ar":"۞ ضَرَبَ اللَّهُ مَثَلًا عَبْدًا مَمْلُوكًا لَا يَقْدِرُ عَلَىٰ شَيْءٍ وَمَنْ رَزَقْنَاهُ مِنَّا رِزْقًا حَسَنًا فَهُوَ يُنْفِقُ مِنْهُ سِرًّا وَجَهْرًا ۖ هَلْ يَسْتَوُونَ ۚ الْحَمْدُ لِلَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ","ayah_en":"God propounds [to you] the parable of [two men-] a man enslaved, unable to do anything of his own accord, and a [free] man upon whom We have bestowed goodly sustenance [as a gift] from Ourselves, so that he can spend thereof [at will, both] secretly and openly. Can these [two] be deemed equal? All praise is due to God [alone]: but most of them do not understand it.","numberInSurah":75,"page":275,"surah_ar":"سُورَةُ النَّحۡلِ","surah_en":"An-Nahl"},{"num":111,"ayah_ar":"۞ إِنَّ اللَّهَ يَأْمُرُ بِالْعَدْلِ وَالْإِحْسَانِ وَإِيتَاءِ ذِي الْقُرْبَىٰ وَيَنْهَىٰ عَنِ الْفَحْشَاءِ وَالْمُنْكَرِ وَالْبَغْيِ ۚ يَعِظُكُمْ لَعَلَّكُمْ تَذَكَّرُونَ","ayah_en":"BEHOLD, God enjoins justice, and the doing of good, and generosity towards [one's] fellow-men; and He forbids all that is shameful and all that runs counter to reason, as well as envy; [and] He exhorts you [repeatedly] so that you might bear [all this] in mind.","numberInSurah":90,"page":277,"surah_ar":"سُورَةُ النَّحۡلِ","surah_en":"An-Nahl"},{"num":112,"ayah_ar":"۞ يَوْمَ تَأْتِي كُلُّ نَفْسٍ تُجَادِلُ عَنْ نَفْسِهَا وَتُوَفَّىٰ كُلُّ نَفْسٍ مَا عَمِلَتْ وَهُمْ لَا يُظْلَمُونَ","ayah_en":"[Be conscious, then, of] the Day when every human being shall come to plead for himself [alone], and every human being shall be repaid in full for whatever he has done, and none shall be wronged.","numberInSurah":111,"page":280,"surah_ar":"سُورَةُ النَّحۡلِ","surah_en":"An-Nahl"},{"num":113,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ سُبْحَانَ الَّذِي أَسْرَىٰ بِعَبْدِهِ لَيْلًا مِنَ الْمَسْجِدِ الْحَرَامِ إِلَى الْمَسْجِدِ الْأَقْصَى الَّذِي بَارَكْنَا حَوْلَهُ لِنُرِيَهُ مِنْ آيَاتِنَا ۚ إِنَّهُ هُوَ السَّمِيعُ الْبَصِيرُ","ayah_en":"LIMITLESS in His glory is He who transported His servant by night from the Inviolable House of Worship [at Mecca] to the Remote House of Worship [, at Jerusalem] - the environs of which We had blessed -so that We might show him some of Our symbols: for, verily, He alone is all-hearing, all-seeing.","numberInSurah":1,"page":282,"surah_ar":"سُورَةُ الإِسۡرَاءِ","surah_en":"Al-Israa"},{"num":114,"ayah_ar":"۞ وَقَضَىٰ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ وَبِالْوَالِدَيْنِ إِحْسَانًا ۚ إِمَّا يَبْلُغَنَّ عِنْدَكَ الْكِبَرَ أَحَدُهُمَا أَوْ كِلَاهُمَا فَلَا تَقُلْ لَهُمَا أُفٍّ وَلَا تَنْهَرْهُمَا وَقُلْ لَهُمَا قَوْلًا كَرِيمًا","ayah_en":"for thy Sustainer has ordained that you shall worship none but Him. And do good unto [thy] parents. Should one of them, or both, attain to old age in thy care, never say \"Ugh\" to them or scold them, but [always] speak unto them with reverent speech,","numberInSurah":23,"page":284,"surah_ar":"سُورَةُ الإِسۡرَاءِ","surah_en":"Al-Israa"},{"num":115,"ayah_ar":"۞ قُلْ كُونُوا حِجَارَةً أَوْ حَدِيدًا","ayah_en":"Say: \"[You will be raised from the dead even though] you be stones or iron","numberInSurah":50,"page":287,"surah_ar":"سُورَةُ الإِسۡرَاءِ","surah_en":"Al-Israa"},{"num":116,"ayah_ar":"۞ وَلَقَدْ كَرَّمْنَا بَنِي آدَمَ وَحَمَلْنَاهُمْ فِي الْبَرِّ وَالْبَحْرِ وَرَزَقْنَاهُمْ مِنَ الطَّيِّبَاتِ وَفَضَّلْنَاهُمْ عَلَىٰ كَثِيرٍ مِمَّنْ خَلَقْنَا تَفْضِيلًا","ayah_en":"NOW, INDEED, We have conferred dignity on the children of Adam, and borne them over land and sea, and provided for them sustenance out of the good things of life, and favoured them far above most of Our creation:","numberInSurah":70,"page":289,"surah_ar":"سُورَةُ الإِسۡرَاءِ","surah_en":"Al-Israa"},{"num":117,"ayah_ar":"۞ أَوَلَمْ يَرَوْا أَنَّ اللَّهَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ قَادِرٌ عَلَىٰ أَنْ يَخْلُقَ مِثْلَهُمْ وَجَعَلَ لَهُمْ أَجَلًا لَا رَيْبَ فِيهِ فَأَبَى الظَّالِمُونَ إِلَّا كُفُورًا","ayah_en":"Are they, then, not aware that God, who has created the heavens and the earth, has the power to create them anew in their own likeness, having, beyond any doubt, set a term for their resurrection? However, all [such] evildoers are unwilling to accept anything but blasphemy!","numberInSurah":99,"page":292,"surah_ar":"سُورَةُ الإِسۡرَاءِ","surah_en":"Al-Israa"},{"num":118,"ayah_ar":"۞ وَتَرَى الشَّمْسَ إِذَا طَلَعَتْ تَزَاوَرُ عَنْ كَهْفِهِمْ ذَاتَ الْيَمِينِ وَإِذَا غَرَبَتْ تَقْرِضُهُمْ ذَاتَ الشِّمَالِ وَهُمْ فِي فَجْوَةٍ مِنْهُ ۚ ذَٰلِكَ مِنْ آيَاتِ اللَّهِ ۗ مَنْ يَهْدِ اللَّهُ فَهُوَ الْمُهْتَدِ ۖ وَمَنْ يُضْلِلْ فَلَنْ تَجِدَ لَهُ وَلِيًّا مُرْشِدًا","ayah_en":"And [for many a year] thou might have seen the sun, on its rising, incline away from their cave on the right, and, on its setting, turn aside from them on the left, while they lived on in that spacious chamber, [bearing witness to] this of God's messages: He whom God guides, he alone has found the right way; whereas for him whom He lets go astray thou canst never find any protector who would point out the right way.","numberInSurah":17,"page":295,"surah_ar":"سُورَةُ الكَهۡفِ","surah_en":"Al-Kahf"},{"num":119,"ayah_ar":"۞ وَاضْرِبْ لَهُمْ مَثَلًا رَجُلَيْنِ جَعَلْنَا لِأَحَدِهِمَا جَنَّتَيْنِ مِنْ أَعْنَابٍ وَحَفَفْنَاهُمَا بِنَخْلٍ وَجَعَلْنَا بَيْنَهُمَا زَرْعًا","ayah_en":"AND PROPOUND unto them the parable of two men, upon one of whom We had bestowed two vinyards, and surrounded them with date-palms, and placed a field of grain in-between.","numberInSurah":32,"page":297,"surah_ar":"سُورَةُ الكَهۡفِ","surah_en":"Al-Kahf"},{"num":120,"ayah_ar":"۞ مَا أَشْهَدْتُهُمْ خَلْقَ السَّمَاوَاتِ وَالْأَرْضِ وَلَا خَلْقَ أَنْفُسِهِمْ وَمَا كُنْتُ مُتَّخِذَ الْمُضِلِّينَ عَضُدًا","ayah_en":"I did not make them witnesses of the creation of the heavens and the earth, nor of the creation of their own selves; and neither do I [have any need to] take as My helpers those [beings] that lead [men] astray.","numberInSurah":51,"page":299,"surah_ar":"سُورَةُ الكَهۡفِ","surah_en":"Al-Kahf"},{"num":121,"ayah_ar":"۞ قَالَ أَلَمْ أَقُلْ لَكَ إِنَّكَ لَنْ تَسْتَطِيعَ مَعِيَ صَبْرًا","ayah_en":"He replied: \"Did I not tell thee that thou wilt never be able to have patience with me?\"","numberInSurah":75,"page":302,"surah_ar":"سُورَةُ الكَهۡفِ","surah_en":"Al-Kahf"},{"num":122,"ayah_ar":"۞ وَتَرَكْنَا بَعْضَهُمْ يَوْمَئِذٍ يَمُوجُ فِي بَعْضٍ ۖ وَنُفِخَ فِي الصُّورِ فَجَمَعْنَاهُمْ جَمْعًا","ayah_en":"AND ON that Day\" We shall [call forth all mankind and] leave them to surge like waves [that dash] against one another; and the trumpet [of judgment] will be blown, and We shall gather them all together.","numberInSurah":99,"page":304,"surah_ar":"سُورَةُ الكَهۡفِ","surah_en":"Al-Kahf"},{"num":123,"ayah_ar":"۞ فَحَمَلَتْهُ فَانْتَبَذَتْ بِهِ مَكَانًا قَصِيًّا","ayah_en":"and in time she conceived him, and then she withdrew with him to a far-off place.","numberInSurah":22,"page":306,"surah_ar":"سُورَةُ مَرۡيَمَ","surah_en":"Maryam"},{"num":124,"ayah_ar":"۞ فَخَلَفَ مِنْ بَعْدِهِمْ خَلْفٌ أَضَاعُوا الصَّلَاةَ وَاتَّبَعُوا الشَّهَوَاتِ ۖ فَسَوْفَ يَلْقَوْنَ غَيًّا","ayah_en":"Yet they were succeeded by generations [of people] who lost all [thought of] prayer and followed [but] their own lusts; and these will, in time, meet with utter disillusion.","numberInSurah":59,"page":309,"surah_ar":"سُورَةُ مَرۡيَمَ","surah_en":"Maryam"},{"num":125,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ طه","ayah_en":"O MAN!","numberInSurah":1,"page":312,"surah_ar":"سُورَةُ طه","surah_en":"Taa-Haa"},{"num":126,"ayah_ar":"۞ مِنْهَا خَلَقْنَاكُمْ وَفِيهَا نُعِيدُكُمْ وَمِنْهَا نُخْرِجُكُمْ تَارَةً أُخْرَىٰ","ayah_en":"out of this [earth] have We created you, and into it shall We return you, and out of it shall We bring you forth once again.","numberInSurah":55,"page":315,"surah_ar":"سُورَةُ طه","surah_en":"Taa-Haa"},{"num":127,"ayah_ar":"۞ وَمَا أَعْجَلَكَ عَنْ قَوْمِكَ يَا مُوسَىٰ","ayah_en":"[AND GOD SAID:] \"Now what has caused thee, O Moses, to leave thy people behind in so great a haste?\"","numberInSurah":83,"page":317,"surah_ar":"سُورَةُ طه","surah_en":"Taa-Haa"},{"num":128,"ayah_ar":"۞ وَعَنَتِ الْوُجُوهُ لِلْحَيِّ الْقَيُّومِ ۖ وَقَدْ خَابَ مَنْ حَمَلَ ظُلْمًا","ayah_en":"And [on that Day] all faces will be humbled before the Ever-Living, the Self-Subsistent Fount of All Being; and undone shall be he who bears [a burden of] evildoing","numberInSurah":111,"page":319,"surah_ar":"سُورَةُ طه","surah_en":"Taa-Haa"},{"num":129,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ اقْتَرَبَ لِلنَّاسِ حِسَابُهُمْ وَهُمْ فِي غَفْلَةٍ مُعْرِضُونَ","ayah_en":"CLOSER DRAWS unto men their reckoning: and yet they remain stubbornly heedless [of its approach].","numberInSurah":1,"page":322,"surah_ar":"سُورَةُ الأَنبِيَاءِ","surah_en":"Al-Anbiyaa"},{"num":130,"ayah_ar":"۞ وَمَنْ يَقُلْ مِنْهُمْ إِنِّي إِلَٰهٌ مِنْ دُونِهِ فَذَٰلِكَ نَجْزِيهِ جَهَنَّمَ ۚ كَذَٰلِكَ نَجْزِي الظَّالِمِينَ","ayah_en":"And if any of them were to say, “Behold, I am deity beside Him” - that one We should requite with hell: thus do We requite all [such] evildoers.","numberInSurah":29,"page":324,"surah_ar":"سُورَةُ الأَنبِيَاءِ","surah_en":"Al-Anbiyaa"},{"num":131,"ayah_ar":"۞ وَلَقَدْ آتَيْنَا إِبْرَاهِيمَ رُشْدَهُ مِنْ قَبْلُ وَكُنَّا بِهِ عَالِمِينَ","ayah_en":"AND, INDEED, long before [the time of Moses] We vouchsafed unto Abraham his consciousness of what is right; and We were aware of [what moved] him","numberInSurah":51,"page":326,"surah_ar":"سُورَةُ الأَنبِيَاءِ","surah_en":"Al-Anbiyaa"},{"num":132,"ayah_ar":"۞ وَأَيُّوبَ إِذْ نَادَىٰ رَبَّهُ أَنِّي مَسَّنِيَ الضُّرُّ وَأَنْتَ أَرْحَمُ الرَّاحِمِينَ","ayah_en":"AND [remember] Job, when he cried out to his Sus­tainer, “Affliction has befallen me: but Thou art the most merciful of the merciful!”","numberInSurah":83,"page":329,"surah_ar":"سُورَةُ الأَنبِيَاءِ","surah_en":"Al-Anbiyaa"},{"num":133,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمْ ۚ إِنَّ زَلْزَلَةَ السَّاعَةِ شَيْءٌ عَظِيمٌ","ayah_en":"O men! Be conscious of your Sustainer: for, verily the violent convulsion of the Last Hour will be an awesome thing!","numberInSurah":1,"page":332,"surah_ar":"سُورَةُ الحَجِّ","surah_en":"Al-Hajj"},{"num":134,"ayah_ar":"۞ هَٰذَانِ خَصْمَانِ اخْتَصَمُوا فِي رَبِّهِمْ ۖ فَالَّذِينَ كَفَرُوا قُطِّعَتْ لَهُمْ ثِيَابٌ مِنْ نَارٍ يُصَبُّ مِنْ فَوْقِ رُءُوسِهِمُ الْحَمِيمُ","ayah_en":"These two contrary kinds of man have become engrossed in contention about their Sus­tainer! But [thus it is:] as for those who are bent on denying the truth garments of fire shall be cut out for them [in the life to come]; burning despair will be poured over their heads,","numberInSurah":19,"page":334,"surah_ar":"سُورَةُ الحَجِّ","surah_en":"Al-Hajj"},{"num":135,"ayah_ar":"۞ إِنَّ اللَّهَ يُدَافِعُ عَنِ الَّذِينَ آمَنُوا ۗ إِنَّ اللَّهَ لَا يُحِبُّ كُلَّ خَوَّانٍ كَفُورٍ","ayah_en":"Verily, God will ward off [all evil] from those who attain to faith; [and,] verily, God does not love anyone who betrays his trust and is bereft of gratitude.","numberInSurah":38,"page":336,"surah_ar":"سُورَةُ الحَجِّ","surah_en":"Al-Hajj"},{"num":136,"ayah_ar":"۞ ذَٰلِكَ وَمَنْ عَاقَبَ بِمِثْلِ مَا عُوقِبَ بِهِ ثُمَّ بُغِيَ عَلَيْهِ لَيَنْصُرَنَّهُ اللَّهُ ۗ إِنَّ اللَّهَ لَعَفُوٌّ غَفُورٌ","ayah_en":"Thus shall it be. And as for him who responds to aggression only to the extent of the attack levelled against him, and is thereupon [again] treacherously attacked - God will most certainly succour him: for, behold, God is indeed an absolver of sins, much-forgiving.","numberInSurah":60,"page":339,"surah_ar":"سُورَةُ الحَجِّ","surah_en":"Al-Hajj"},{"num":137,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ قَدْ أَفْلَحَ الْمُؤْمِنُونَ","ayah_en":"TRULY, to a happy state shall attain the believers:","numberInSurah":1,"page":342,"surah_ar":"سُورَةُ المُؤۡمِنُونَ","surah_en":"Al-Muminoon"},{"num":138,"ayah_ar":"۞ هَيْهَاتَ هَيْهَاتَ لِمَا تُوعَدُونَ","ayah_en":"Far-fetched, far-fetched indeed is what you are promised!","numberInSurah":36,"page":344,"surah_ar":"سُورَةُ المُؤۡمِنُونَ","surah_en":"Al-Muminoon"},{"num":139,"ayah_ar":"۞ وَلَوْ رَحِمْنَاهُمْ وَكَشَفْنَا مَا بِهِمْ مِنْ ضُرٍّ لَلَجُّوا فِي طُغْيَانِهِمْ يَعْمَهُونَ","ayah_en":"And even were We to show them mercy and remove whatever distress might befall them [in this life], they would still persist in their overweening arrogance, blindly stumbling to and fro.","numberInSurah":75,"page":347,"surah_ar":"سُورَةُ المُؤۡمِنُونَ","surah_en":"Al-Muminoon"},{"num":140,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ سُورَةٌ أَنْزَلْنَاهَا وَفَرَضْنَاهَا وَأَنْزَلْنَا فِيهَا آيَاتٍ بَيِّنَاتٍ لَعَلَّكُمْ تَذَكَّرُونَ","ayah_en":"A Surah [is this] which We have bestowed from on high, and which We have laid down in plain terms; and in it have We bestowed from on high messages which are clear [in themselves], so that you might keep [them] in mind.","numberInSurah":1,"page":350,"surah_ar":"سُورَةُ النُّورِ","surah_en":"An-Noor"},{"num":141,"ayah_ar":"۞ يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّبِعُوا خُطُوَاتِ الشَّيْطَانِ ۚ وَمَنْ يَتَّبِعْ خُطُوَاتِ الشَّيْطَانِ فَإِنَّهُ يَأْمُرُ بِالْفَحْشَاءِ وَالْمُنْكَرِ ۚ وَلَوْلَا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ مَا زَكَىٰ مِنْكُمْ مِنْ أَحَدٍ أَبَدًا وَلَٰكِنَّ اللَّهَ يُزَكِّي مَنْ يَشَاءُ ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ","ayah_en":"O You who have attained to faith! Follow not Satan’s footsteps: for he who follows Satan’s foot­steps [will find that], behold, he enjoins but deeds of abomination and all that runs counter to reason. And were it not for God’s favour upon you and His grace, not one of you would ever have remained pure. For [thus it is:] God who causes whomever He wills to grow in purity: for God is all-hearing, all-­knowing.","numberInSurah":21,"page":352,"surah_ar":"سُورَةُ النُّورِ","surah_en":"An-Noor"},{"num":142,"ayah_ar":"۞ اللَّهُ نُورُ السَّمَاوَاتِ وَالْأَرْضِ ۚ مَثَلُ نُورِهِ كَمِشْكَاةٍ فِيهَا مِصْبَاحٌ ۖ الْمِصْبَاحُ فِي زُجَاجَةٍ ۖ الزُّجَاجَةُ كَأَنَّهَا كَوْكَبٌ دُرِّيٌّ يُوقَدُ مِنْ شَجَرَةٍ مُبَارَكَةٍ زَيْتُونَةٍ لَا شَرْقِيَّةٍ وَلَا غَرْبِيَّةٍ يَكَادُ زَيْتُهَا يُضِيءُ وَلَوْ لَمْ تَمْسَسْهُ نَارٌ ۚ نُورٌ عَلَىٰ نُورٍ ۗ يَهْدِي اللَّهُ لِنُورِهِ مَنْ يَشَاءُ ۚ وَيَضْرِبُ اللَّهُ الْأَمْثَالَ لِلنَّاسِ ۗ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ","ayah_en":"God is the Light of the heavens and the earth. The parable of His light is, as it were, that of a niche containing a lamp; the lamp is [enclosed] in glass, the glass [shining] like a radiant star: [a lamp] lit from a blessed tree - an olive-tree that is neither of the east nor of the west the oil whereof [is so bright that it] would well-nigh give light [of itself] even though fire had not touched it: light upon light! God guides unto His light him that wills [to be guided]; and [to this end] God propounds parables unto men, since God [alone] has full knowledge of all things.","numberInSurah":35,"page":354,"surah_ar":"سُورَةُ النُّورِ","surah_en":"An-Noor"},{"num":143,"ayah_ar":"۞ وَأَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ لَئِنْ أَمَرْتَهُمْ لَيَخْرُجُنَّ ۖ قُلْ لَا تُقْسِمُوا ۖ طَاعَةٌ مَعْرُوفَةٌ ۚ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ","ayah_en":"Now [as for those half-hearted ones,] they do swear by God with their most solemn oaths that if thou [O Apostle] shouldst ever bid them to do so, they would most certainly go forth [and sacrifice themselves]. Say: “Swear not! Reasonable compliance [with God’s message is all that is required of you]. Verily, God is aware of all that you do!”","numberInSurah":53,"page":356,"surah_ar":"سُورَةُ النُّورِ","surah_en":"An-Noor"},{"num":144,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ تَبَارَكَ الَّذِي نَزَّلَ الْفُرْقَانَ عَلَىٰ عَبْدِهِ لِيَكُونَ لِلْعَالَمِينَ نَذِيرًا","ayah_en":"Hallowed is He who from on high, step by step, has bestowed upon His servant the standard by which to discern the true from the false, so that to all the world it might be a warning:","numberInSurah":1,"page":359,"surah_ar":"سُورَةُ الفُرۡقَانِ","surah_en":"Al-Furqaan"},{"num":145,"ayah_ar":"۞ وَقَالَ الَّذِينَ لَا يَرْجُونَ لِقَاءَنَا لَوْلَا أُنْزِلَ عَلَيْنَا الْمَلَائِكَةُ أَوْ نَرَىٰ رَبَّنَا ۗ لَقَدِ اسْتَكْبَرُوا فِي أَنْفُسِهِمْ وَعَتَوْا عُتُوًّا كَبِيرًا","ayah_en":"But those who do not believe that they are destined to meet Us are wont to say, “Why have no angels been sent down to us?” – or, “Why do we not see our Sustainer?” Indeed, they are far too proud of themselves, hav­ing rebelled [against God’s truth] with utter disdain!","numberInSurah":21,"page":362,"surah_ar":"سُورَةُ الفُرۡقَانِ","surah_en":"Al-Furqaan"},{"num":146,"ayah_ar":"۞ وَهُوَ الَّذِي مَرَجَ الْبَحْرَيْنِ هَٰذَا عَذْبٌ فُرَاتٌ وَهَٰذَا مِلْحٌ أُجَاجٌ وَجَعَلَ بَيْنَهُمَا بَرْزَخًا وَحِجْرًا مَحْجُورًا","ayah_en":"AND HE it is who has given freedom of movement to the two great bodies of water – the one sweet and thirst-allaying, and the other salty and bitter - and yet has wrought between them a barrier and a forbidding ban.","numberInSurah":53,"page":364,"surah_ar":"سُورَةُ الفُرۡقَانِ","surah_en":"Al-Furqaan"},{"num":147,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ طسم","ayah_en":"Ta. Sin, Mim.","numberInSurah":1,"page":367,"surah_ar":"سُورَةُ الشُّعَرَاءِ","surah_en":"Ash-Shu'araa"},{"num":148,"ayah_ar":"۞ وَأَوْحَيْنَا إِلَىٰ مُوسَىٰ أَنْ أَسْرِ بِعِبَادِي إِنَّكُمْ مُتَّبَعُونَ","ayah_en":"AND [there came a time when] We inspired Moses thus: “Go forth with My servants by night: for, behold, you will he pursued!”","numberInSurah":52,"page":369,"surah_ar":"سُورَةُ الشُّعَرَاءِ","surah_en":"Ash-Shu'araa"},{"num":149,"ayah_ar":"۞ قَالُوا أَنُؤْمِنُ لَكَ وَاتَّبَعَكَ الْأَرْذَلُونَ","ayah_en":"They answered: “Shall we place our faith in thee, even though [only] the most abject [of people] follow thee?”","numberInSurah":111,"page":371,"surah_ar":"سُورَةُ الشُّعَرَاءِ","surah_en":"Ash-Shu'araa"},{"num":150,"ayah_ar":"۞ أَوْفُوا الْكَيْلَ وَلَا تَكُونُوا مِنَ الْمُخْسِرِينَ","ayah_en":"“[Always] give full measure, and be not among those who [unjustly] cause loss [to others];","numberInSurah":181,"page":374,"surah_ar":"سُورَةُ الشُّعَرَاءِ","surah_en":"Ash-Shu'araa"},{"num":151,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ طس ۚ تِلْكَ آيَاتُ الْقُرْآنِ وَكِتَابٍ مُبِينٍ","ayah_en":"Ta. Sin. THESE ARE MESSAGES of the Qur’an - a di­vine writ clear in itself and clearly showing the truth:","numberInSurah":1,"page":377,"surah_ar":"سُورَةُ النَّمۡلِ","surah_en":"An-Naml"},{"num":152,"ayah_ar":"۞ قَالَ سَنَنْظُرُ أَصَدَقْتَ أَمْ كُنْتَ مِنَ الْكَاذِبِينَ","ayah_en":"Said [Solomon]: “We shall see whether thou hast told the truth or art one of the liars!","numberInSurah":27,"page":379,"surah_ar":"سُورَةُ النَّمۡلِ","surah_en":"An-Naml"},{"num":153,"ayah_ar":"۞ فَمَا كَانَ جَوَابَ قَوْمِهِ إِلَّا أَنْ قَالُوا أَخْرِجُوا آلَ لُوطٍ مِنْ قَرْيَتِكُمْ ۖ إِنَّهُمْ أُنَاسٌ يَتَطَهَّرُونَ","ayah_en":"But his people’s only answer was this: “Expel [Lot and] Lot’s followers from your township! Verily, they are folk who make themselves out to be pure!”","numberInSurah":56,"page":382,"surah_ar":"سُورَةُ النَّمۡلِ","surah_en":"An-Naml"},{"num":154,"ayah_ar":"۞ وَإِذَا وَقَعَ الْقَوْلُ عَلَيْهِمْ أَخْرَجْنَا لَهُمْ دَابَّةً مِنَ الْأَرْضِ تُكَلِّمُهُمْ أَنَّ النَّاسَ كَانُوا بِآيَاتِنَا لَا يُوقِنُونَ","ayah_en":"Now, [as for the deaf and blind of heart –] when the word [of truth] stands revealed against them, We shall bring forth unto them out of the earth a creature, which will tell them that mankind had no real faith in Our messages.","numberInSurah":82,"page":384,"surah_ar":"سُورَةُ النَّمۡلِ","surah_en":"An-Naml"},{"num":155,"ayah_ar":"۞ وَحَرَّمْنَا عَلَيْهِ الْمَرَاضِعَ مِنْ قَبْلُ فَقَالَتْ هَلْ أَدُلُّكُمْ عَلَىٰ أَهْلِ بَيْتٍ يَكْفُلُونَهُ لَكُمْ وَهُمْ لَهُ نَاصِحُونَ","ayah_en":"Now from the very beginning We caused him to refuse the breast of [Egyptian] nurses; and [when his sister came to know this,] she said: “Shall I guide you to a family that might rear him for you, and look after him with good will?”","numberInSurah":12,"page":386,"surah_ar":"سُورَةُ القَصَصِ","surah_en":"Al-Qasas"},{"num":156,"ayah_ar":"۞ فَلَمَّا قَضَىٰ مُوسَى الْأَجَلَ وَسَارَ بِأَهْلِهِ آنَسَ مِنْ جَانِبِ الطُّورِ نَارًا قَالَ لِأَهْلِهِ امْكُثُوا إِنِّي آنَسْتُ نَارًا لَعَلِّي آتِيكُمْ مِنْهَا بِخَبَرٍ أَوْ جَذْوَةٍ مِنَ النَّارِ لَعَلَّكُمْ تَصْطَلُونَ","ayah_en":"And when Moses had fulfilled his term and was wandering with his family [in the desert], he per­ceived a fire on the slope of Mount Sinai; [and so] he said to his family: “Wait here. Behold, I perceive a fire [far away]; perhaps I may bring you from there some tiding, or [at least] a burning brand from the fire, so that you might warm yourselves.","numberInSurah":29,"page":389,"surah_ar":"سُورَةُ القَصَصِ","surah_en":"Al-Qasas"},{"num":157,"ayah_ar":"۞ وَلَقَدْ وَصَّلْنَا لَهُمُ الْقَوْلَ لَعَلَّهُمْ يَتَذَكَّرُونَ","ayah_en":"NOW, INDEED, We have caused this word [of Ours] to reach mankind step by step, so that they might [learn to] keep it in mind.","numberInSurah":51,"page":392,"surah_ar":"سُورَةُ القَصَصِ","surah_en":"Al-Qasas"},{"num":158,"ayah_ar":"۞ إِنَّ قَارُونَ كَانَ مِنْ قَوْمِ مُوسَىٰ فَبَغَىٰ عَلَيْهِمْ ۖ وَآتَيْنَاهُ مِنَ الْكُنُوزِ مَا إِنَّ مَفَاتِحَهُ لَتَنُوءُ بِالْعُصْبَةِ أُولِي الْقُوَّةِ إِذْ قَالَ لَهُ قَوْمُهُ لَا تَفْرَحْ ۖ إِنَّ اللَّهَ لَا يُحِبُّ الْفَرِحِينَ","ayah_en":"[NOW,] BEHOLD, Qarun was one of the people of Moses; but he arrogantly exalted himself above them - simply because We had granted him such riches that his treasure-chests alone would surely have been too heavy a burden for a troop of ten men or even more. When [they perceived his arrogance,] his people said unto him: “Exult not [in thy wealth], for, verily, God does not love those who exult [in things vain]!","numberInSurah":76,"page":394,"surah_ar":"سُورَةُ القَصَصِ","surah_en":"Al-Qasas"},{"num":159,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ الم","ayah_en":"Alif. Lam. Mim.","numberInSurah":1,"page":396,"surah_ar":"سُورَةُ العَنكَبُوتِ","surah_en":"Al-Ankaboot"},{"num":160,"ayah_ar":"۞ فَآمَنَ لَهُ لُوطٌ ۘ وَقَالَ إِنِّي مُهَاجِرٌ إِلَىٰ رَبِّي ۖ إِنَّهُ هُوَ الْعَزِيزُ الْحَكِيمُ","ayah_en":"Thereupon [his brother’s son] Lot came to believe in him and said: “Verily, I [too] shall forsake the domain of evil [and turn] to my Sustainer: for, verily, He alone is almighty, truly wise!”","numberInSurah":26,"page":399,"surah_ar":"سُورَةُ العَنكَبُوتِ","surah_en":"Al-Ankaboot"},{"num":161,"ayah_ar":"۞ وَلَا تُجَادِلُوا أَهْلَ الْكِتَابِ إِلَّا بِالَّتِي هِيَ أَحْسَنُ إِلَّا الَّذِينَ ظَلَمُوا مِنْهُمْ ۖ وَقُولُوا آمَنَّا بِالَّذِي أُنْزِلَ إِلَيْنَا وَأُنْزِلَ إِلَيْكُمْ وَإِلَٰهُنَا وَإِلَٰهُكُمْ وَاحِدٌ وَنَحْنُ لَهُ مُسْلِمُونَ","ayah_en":"And do not argue with the followers of earlier revelation otherwise than in a most kindly manner - unless it be such of them as are bent on evildoing and say: “We believe in that which has been be­stowed from on high upon us, as well as that which has been bestowed upon you: or our God and your God is one and the same, and it is unto Him that We [all] surrender ourselves.”","numberInSurah":46,"page":402,"surah_ar":"سُورَةُ العَنكَبُوتِ","surah_en":"Al-Ankaboot"},{"num":162,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ الم","ayah_en":"Alif. Lam. Mim.","numberInSurah":1,"page":404,"surah_ar":"سُورَةُ الرُّومِ","surah_en":"Ar-Room"},{"num":163,"ayah_ar":"۞ مُنِيبِينَ إِلَيْهِ وَاتَّقُوهُ وَأَقِيمُوا الصَّلَاةَ وَلَا تَكُونُوا مِنَ الْمُشْرِكِينَ","ayah_en":"[Turn, then, away from all that is false,] turn­ing unto Him [alone]; and remain conscious of Him, and be constant in prayer, and be not among those who ascribe divinity to aught beside Him,","numberInSurah":31,"page":407,"surah_ar":"سُورَةُ الرُّومِ","surah_en":"Ar-Room"},{"num":164,"ayah_ar":"۞ اللَّهُ الَّذِي خَلَقَكُمْ مِنْ ضَعْفٍ ثُمَّ جَعَلَ مِنْ بَعْدِ ضَعْفٍ قُوَّةً ثُمَّ جَعَلَ مِنْ بَعْدِ قُوَّةٍ ضَعْفًا وَشَيْبَةً ۚ يَخْلُقُ مَا يَشَاءُ ۖ وَهُوَ الْعَلِيمُ الْقَدِيرُ","ayah_en":"IT IS GOD who creates you [all in a states of weak­ness, and then, after weakness, ordains strength [for you], and then, after [a period of] strength, ordains [old-age] weakness and grey hair. He creates what He wills; and He alone is all-knowing, infinite in His power.","numberInSurah":54,"page":410,"surah_ar":"سُورَةُ الرُّومِ","surah_en":"Ar-Room"},{"num":165,"ayah_ar":"۞ وَمَنْ يُسْلِمْ وَجْهَهُ إِلَى اللَّهِ وَهُوَ مُحْسِنٌ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَىٰ ۗ وَإِلَى اللَّهِ عَاقِبَةُ الْأُمُورِ","ayah_en":"Now whoever surrenders his whole being unto God, and is a doer of good withal, has indeed taken hold of a support most unfailing: for with God rests the final outcome of all events.","numberInSurah":22,"page":413,"surah_ar":"سُورَةُ لُقۡمَانَ","surah_en":"Luqman"},{"num":166,"ayah_ar":"۞ قُلْ يَتَوَفَّاكُمْ مَلَكُ الْمَوْتِ الَّذِي وُكِّلَ بِكُمْ ثُمَّ إِلَىٰ رَبِّكُمْ تُرْجَعُونَ","ayah_en":"Say: “[One day,] the angel of death who has been given charge of you will gather you, and then unto your Sustainer you will be brought back.”","numberInSurah":11,"page":415,"surah_ar":"سُورَةُ السَّجۡدَةِ","surah_en":"As-Sajda"},{"num":167,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ يَا أَيُّهَا النَّبِيُّ اتَّقِ اللَّهَ وَلَا تُطِعِ الْكَافِرِينَ وَالْمُنَافِقِينَ ۗ إِنَّ اللَّهَ كَانَ عَلِيمًا حَكِيمًا","ayah_en":"PROPHET! Remain conscious of God, and defer not to the deniers of the truth and the hypo­crites: for God is truly all-knowing, wise.","numberInSurah":1,"page":418,"surah_ar":"سُورَةُ الأَحۡزَابِ","surah_en":"Al-Ahzaab"},{"num":168,"ayah_ar":"۞ قَدْ يَعْلَمُ اللَّهُ الْمُعَوِّقِينَ مِنْكُمْ وَالْقَائِلِينَ لِإِخْوَانِهِمْ هَلُمَّ إِلَيْنَا ۖ وَلَا يَأْتُونَ الْبَأْسَ إِلَّا قَلِيلًا","ayah_en":"God is indeed aware of those of you who would divert others [from fighting in His cause], as well as of those who say to their brethren, “Come hither to us [and face the enemy]!” — The while they [themselves] join battle but seldom,","numberInSurah":18,"page":420,"surah_ar":"سُورَةُ الأَحۡزَابِ","surah_en":"Al-Ahzaab"},{"num":169,"ayah_ar":"۞ وَمَنْ يَقْنُتْ مِنْكُنَّ لِلَّهِ وَرَسُولِهِ وَتَعْمَلْ صَالِحًا نُؤْتِهَا أَجْرَهَا مَرَّتَيْنِ وَأَعْتَدْنَا لَهَا رِزْقًا كَرِيمًا","ayah_en":"But if any of you devoutly obeys God and His Apostle and does good deeds, on her shall We bestow her reward twice-over: for We shall have readied for her a most excellent sustenance [in the life to come].","numberInSurah":31,"page":422,"surah_ar":"سُورَةُ الأَحۡزَابِ","surah_en":"Al-Ahzaab"},{"num":170,"ayah_ar":"۞ تُرْجِي مَنْ تَشَاءُ مِنْهُنَّ وَتُؤْوِي إِلَيْكَ مَنْ تَشَاءُ ۖ وَمَنِ ابْتَغَيْتَ مِمَّنْ عَزَلْتَ فَلَا جُنَاحَ عَلَيْكَ ۚ ذَٰلِكَ أَدْنَىٰ أَنْ تَقَرَّ أَعْيُنُهُنَّ وَلَا يَحْزَنَّ وَيَرْضَيْنَ بِمَا آتَيْتَهُنَّ كُلُّهُنَّ ۚ وَاللَّهُ يَعْلَمُ مَا فِي قُلُوبِكُمْ ۚ وَكَانَ اللَّهُ عَلِيمًا حَلِيمًا","ayah_en":"[know that] thou mayest put off for a time whichever of them thou pleasest, and mayest take unto thee whichever thou pleasest; and [that,] if thou seek out any from whom thou hast kept away [for a time], thou wilt incur no sin [thereby]: this will make it more likely that their eyes are gladdened [whenever they see thee], and that they do not grieve [whenever they are overlooked], and that all of them may find contentment in whatever thou hast to give them: for God [alone] knows what is in your hearts - and God is indeed all-knowing, for­bearing.","numberInSurah":51,"page":425,"surah_ar":"سُورَةُ الأَحۡزَابِ","surah_en":"Al-Ahzaab"},{"num":171,"ayah_ar":"۞ لَئِنْ لَمْ يَنْتَهِ الْمُنَافِقُونَ وَالَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ وَالْمُرْجِفُونَ فِي الْمَدِينَةِ لَنُغْرِيَنَّكَ بِهِمْ ثُمَّ لَا يُجَاوِرُونَكَ فِيهَا إِلَّا قَلِيلًا","ayah_en":"THUS IT IS: if the hypocrites, and they in whose hearts is disease, and they who, by spreading false rumours, would cause disturbances in the City [of the Prophet] desist not [from their hostile doings]. We shall indeed give thee mastery over them, [O Muhammad] - and then they will not remain thy neighbours in this [city] for more than a little while:","numberInSurah":60,"page":426,"surah_ar":"سُورَةُ الأَحۡزَابِ","surah_en":"Al-Ahzaab"},{"num":172,"ayah_ar":"۞ وَلَقَدْ آتَيْنَا دَاوُودَ مِنَّا فَضْلًا ۖ يَا جِبَالُ أَوِّبِي مَعَهُ وَالطَّيْرَ ۖ وَأَلَنَّا لَهُ الْحَدِيدَ","ayah_en":"AND [thus], indeed, did We grace David with Our favour: “O you mountains! Sing with him the praise of God! And [likewise] you birds!” And We softened all sharpness in him,","numberInSurah":10,"page":429,"surah_ar":"سُورَةُ سَبَإٍ","surah_en":"Saba"},{"num":173,"ayah_ar":"۞ قُلْ مَنْ يَرْزُقُكُمْ مِنَ السَّمَاوَاتِ وَالْأَرْضِ ۖ قُلِ اللَّهُ ۖ وَإِنَّا أَوْ إِيَّاكُمْ لَعَلَىٰ هُدًى أَوْ فِي ضَلَالٍ مُبِينٍ","ayah_en":"Say: “Who is it that provides for you sus­tenance out of the heavens and the earth?” Say: “It is God. And, behold, either we [who believe in Him] or you [who deny His oneness] are on the right path, or have clearly gone astray!”","numberInSurah":24,"page":431,"surah_ar":"سُورَةُ سَبَإٍ","surah_en":"Saba"},{"num":174,"ayah_ar":"۞ قُلْ إِنَّمَا أَعِظُكُمْ بِوَاحِدَةٍ ۖ أَنْ تَقُومُوا لِلَّهِ مَثْنَىٰ وَفُرَادَىٰ ثُمَّ تَتَفَكَّرُوا ۚ مَا بِصَاحِبِكُمْ مِنْ جِنَّةٍ ۚ إِنْ هُوَ إِلَّا نَذِيرٌ لَكُمْ بَيْنَ يَدَيْ عَذَابٍ شَدِيدٍ","ayah_en":"Say: “I counsel you one thing only: Be [ever­ conscious of] standing before God, whether you are in the company of others or alone; and then bethink yourselves [that] there is no madness in [this pro­phet,] your fellow-man: he is only a warner to you of suffering severe to come.”","numberInSurah":46,"page":433,"surah_ar":"سُورَةُ سَبَإٍ","surah_en":"Saba"},{"num":175,"ayah_ar":"۞ يَا أَيُّهَا النَّاسُ أَنْتُمُ الْفُقَرَاءُ إِلَى اللَّهِ ۖ وَاللَّهُ هُوَ الْغَنِيُّ الْحَمِيدُ","ayah_en":"O men! It is you, who stand in need of God, whereas He alone is self-sufficient, the One to whom all praise is due.","numberInSurah":15,"page":436,"surah_ar":"سُورَةُ فَاطِرٍ","surah_en":"Faatir"},{"num":176,"ayah_ar":"۞ إِنَّ اللَّهَ يُمْسِكُ السَّمَاوَاتِ وَالْأَرْضَ أَنْ تَزُولَا ۚ وَلَئِنْ زَالَتَا إِنْ أَمْسَكَهُمَا مِنْ أَحَدٍ مِنْ بَعْدِهِ ۚ إِنَّهُ كَانَ حَلِيمًا غَفُورًا","ayah_en":"Verily, it is God [alone] who upholds the celestial bodies and the earth, lest they deviate [from their orbits] - for if they should ever deviate, there is none that could uphold them after He will have ceased to do so. [But,] verily, He is ever-forbearing, much-for­giving!","numberInSurah":41,"page":439,"surah_ar":"سُورَةُ فَاطِرٍ","surah_en":"Faatir"},{"num":177,"ayah_ar":"۞ وَمَا أَنْزَلْنَا عَلَىٰ قَوْمِهِ مِنْ بَعْدِهِ مِنْ جُنْدٍ مِنَ السَّمَاءِ وَمَا كُنَّا مُنْزِلِينَ","ayah_en":"And after that, no host out of heaven did We send down against his people, nor did We need to send down any:","numberInSurah":28,"page":442,"surah_ar":"سُورَةُ يسٓ","surah_en":"Yaseen"},{"num":178,"ayah_ar":"۞ أَلَمْ أَعْهَدْ إِلَيْكُمْ يَا بَنِي آدَمَ أَنْ لَا تَعْبُدُوا الشَّيْطَانَ ۖ إِنَّهُ لَكُمْ عَدُوٌّ مُبِينٌ","ayah_en":"Did I not enjoin on you, O you children of Adam, that you should not worship Satan – since, verily, he is your open foe","numberInSurah":60,"page":444,"surah_ar":"سُورَةُ يسٓ","surah_en":"Yaseen"},{"num":179,"ayah_ar":"۞ احْشُرُوا الَّذِينَ ظَلَمُوا وَأَزْوَاجَهُمْ وَمَا كَانُوا يَعْبُدُونَ","ayah_en":"[And God will thus command:] “Assemble all those who were bent on evildoing, together with others of their ilk and [with] all that they were wont to worship","numberInSurah":22,"page":446,"surah_ar":"سُورَةُ الصَّافَّاتِ","surah_en":"As-Saaffaat"},{"num":180,"ayah_ar":"۞ وَإِنَّ مِنْ شِيعَتِهِ لَإِبْرَاهِيمَ","ayah_en":"AND, BEHOLD, of his persuasion was Abraham, too,","numberInSurah":83,"page":449,"surah_ar":"سُورَةُ الصَّافَّاتِ","surah_en":"As-Saaffaat"},{"num":181,"ayah_ar":"۞ فَنَبَذْنَاهُ بِالْعَرَاءِ وَهُوَ سَقِيمٌ","ayah_en":"but We caused him to be cast forth on a desert shore, sick [at heart] as he was,","numberInSurah":145,"page":451,"surah_ar":"سُورَةُ الصَّافَّاتِ","surah_en":"As-Saaffaat"},{"num":182,"ayah_ar":"۞ وَهَلْ أَتَاكَ نَبَأُ الْخَصْمِ إِذْ تَسَوَّرُوا الْمِحْرَابَ","ayah_en":"AND YET, has the story of the litigants come within thy ken - [the story of the two] who surmounted the walls of the sanctuary [in which David prayed]?","numberInSurah":21,"page":454,"surah_ar":"سُورَةُ صٓ","surah_en":"Saad"},{"num":183,"ayah_ar":"۞ وَعِنْدَهُمْ قَاصِرَاتُ الطَّرْفِ أَتْرَابٌ","ayah_en":"having beside them well-matched mates of modest gaze.”","numberInSurah":52,"page":456,"surah_ar":"سُورَةُ صٓ","surah_en":"Saad"},{"num":184,"ayah_ar":"۞ وَإِذَا مَسَّ الْإِنْسَانَ ضُرٌّ دَعَا رَبَّهُ مُنِيبًا إِلَيْهِ ثُمَّ إِذَا خَوَّلَهُ نِعْمَةً مِنْهُ نَسِيَ مَا كَانَ يَدْعُو إِلَيْهِ مِنْ قَبْلُ وَجَعَلَ لِلَّهِ أَنْدَادًا لِيُضِلَّ عَنْ سَبِيلِهِ ۚ قُلْ تَمَتَّعْ بِكُفْرِكَ قَلِيلًا ۖ إِنَّكَ مِنْ أَصْحَابِ النَّارِ","ayah_en":"NOW [thus it is:] when affliction befalls man, he is likely to cry out to his Sustainer, turning unto Him [for help]; but as soon as He has bestowed upon him a boon by His grace, he forgets Him whom he in­voked before, and claims that there are other powers that could rival God - and thus leads [others] astray from His path. Say [unto him who sins in this way]: “Enjoy thyself for a while in this thy denial of the truth; [yet,] verily, thou art of those who are destined for the fire!","numberInSurah":8,"page":459,"surah_ar":"سُورَةُ الزُّمَرِ","surah_en":"Az-Zumar"},{"num":185,"ayah_ar":"۞ فَمَنْ أَظْلَمُ مِمَّنْ كَذَبَ عَلَى اللَّهِ وَكَذَّبَ بِالصِّدْقِ إِذْ جَاءَهُ ۚ أَلَيْسَ فِي جَهَنَّمَ مَثْوًى لِلْكَافِرِينَ","ayah_en":"And who could be more wicked than he who invents lies about God? and gives the lie to the truth as soon as it has been placed before him? Is not hell the [proper] abode for all who deny the truth?","numberInSurah":32,"page":462,"surah_ar":"سُورَةُ الزُّمَرِ","surah_en":"Az-Zumar"},{"num":186,"ayah_ar":"۞ قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنْفُسِهِمْ لَا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ ۚ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ","ayah_en":"SAY: “[Thus speaks God:] ‘O you servants of Mine who have transgressed against your own selves! Despair not of God’s mercy: behold, God forgives all sins - for, verily, He alone is much-forgiving, a dis­penser of grace!’”","numberInSurah":53,"page":464,"surah_ar":"سُورَةُ الزُّمَرِ","surah_en":"Az-Zumar"},{"num":187,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ حم","ayah_en":"Ha. Mim.","numberInSurah":1,"page":467,"surah_ar":"سُورَةُ غَافِرٍ","surah_en":"Ghafir"},{"num":188,"ayah_ar":"۞ أَوَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنْظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ كَانُوا مِنْ قَبْلِهِمْ ۚ كَانُوا هُمْ أَشَدَّ مِنْهُمْ قُوَّةً وَآثَارًا فِي الْأَرْضِ فَأَخَذَهُمُ اللَّهُ بِذُنُوبِهِمْ وَمَا كَانَ لَهُمْ مِنَ اللَّهِ مِنْ وَاقٍ","ayah_en":"Have they, then, never journeyed about the earth and beheld what happened in the end to those [deniers of the truth] who lived before their time? Greater were they in power than they are, and in the impact which they left on earth: but God took them to task for their sins, and they had none to defend them against God:","numberInSurah":21,"page":469,"surah_ar":"سُورَةُ غَافِرٍ","surah_en":"Ghafir"},{"num":189,"ayah_ar":"۞ وَيَا قَوْمِ مَا لِي أَدْعُوكُمْ إِلَى النَّجَاةِ وَتَدْعُونَنِي إِلَى النَّارِ","ayah_en":"“And, O my people, how is it that I summon you to salvation, the while you summon me to the fire?","numberInSurah":41,"page":472,"surah_ar":"سُورَةُ غَافِرٍ","surah_en":"Ghafir"},{"num":190,"ayah_ar":"۞ قُلْ إِنِّي نُهِيتُ أَنْ أَعْبُدَ الَّذِينَ تَدْعُونَ مِنْ دُونِ اللَّهِ لَمَّا جَاءَنِيَ الْبَيِّنَاتُ مِنْ رَبِّي وَأُمِرْتُ أَنْ أُسْلِمَ لِرَبِّ الْعَالَمِينَ","ayah_en":"Say: “Since all evidence of the truth has come to me from my Sustainer, I am forbidden to worship [any of] those beings whom you invoke instead of God; and I am bidden to surrender myself to the Sustainer of all the worlds.”","numberInSurah":66,"page":474,"surah_ar":"سُورَةُ غَافِرٍ","surah_en":"Ghafir"},{"num":191,"ayah_ar":"۞ قُلْ أَئِنَّكُمْ لَتَكْفُرُونَ بِالَّذِي خَلَقَ الْأَرْضَ فِي يَوْمَيْنِ وَتَجْعَلُونَ لَهُ أَنْدَادًا ۚ ذَٰلِكَ رَبُّ الْعَالَمِينَ","ayah_en":"SAY: “Would you indeed deny Him who has created the earth in two aeons? And do you claim that there is any power that could rival Him, the Sustainer of all the worlds?”","numberInSurah":9,"page":477,"surah_ar":"سُورَةُ فُصِّلَتۡ","surah_en":"Fussilat"},{"num":192,"ayah_ar":"۞ وَقَيَّضْنَا لَهُمْ قُرَنَاءَ فَزَيَّنُوا لَهُمْ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَحَقَّ عَلَيْهِمُ الْقَوْلُ فِي أُمَمٍ قَدْ خَلَتْ مِنْ قَبْلِهِمْ مِنَ الْجِنِّ وَالْإِنْسِ ۖ إِنَّهُمْ كَانُوا خَاسِرِينَ","ayah_en":"for [when they became obli­vious of Us,] We assigned to them [their own evil impulses as their] other selves, and these made appear goodly to them whatever lay open before them and whatever was beyond their ken. And so, the sentence [of doom] will have fallen due upon them together with the [other sinful] com­munities of invisible beings and humans that passed away before their time: verily, they [all] will indeed be lost!","numberInSurah":25,"page":479,"surah_ar":"سُورَةُ فُصِّلَتۡ","surah_en":"Fussilat"},{"num":193,"ayah_ar":"۞ إِلَيْهِ يُرَدُّ عِلْمُ السَّاعَةِ ۚ وَمَا تَخْرُجُ مِنْ ثَمَرَاتٍ مِنْ أَكْمَامِهَا وَمَا تَحْمِلُ مِنْ أُنْثَىٰ وَلَا تَضَعُ إِلَّا بِعِلْمِهِ ۚ وَيَوْمَ يُنَادِيهِمْ أَيْنَ شُرَكَائِي قَالُوا آذَنَّاكَ مَا مِنَّا مِنْ شَهِيدٍ","ayah_en":"In Him alone is vested the knowledge of when the Last Hour will come. And no fruit bursts forth from its calyx, and no female ever conceives, nor ever gives birth, save with His knowledge. And so, on the Day when He shall call out to them, “Where, now, are those [alleged] partners of Mine?” - they will [surely] answer, “We confess unto Thee that none of us can bear witness [to anyone’s having a share in Thy divinity]!”","numberInSurah":47,"page":482,"surah_ar":"سُورَةُ فُصِّلَتۡ","surah_en":"Fussilat"},{"num":194,"ayah_ar":"۞ شَرَعَ لَكُمْ مِنَ الدِّينِ مَا وَصَّىٰ بِهِ نُوحًا وَالَّذِي أَوْحَيْنَا إِلَيْكَ وَمَا وَصَّيْنَا بِهِ إِبْرَاهِيمَ وَمُوسَىٰ وَعِيسَىٰ ۖ أَنْ أَقِيمُوا الدِّينَ وَلَا تَتَفَرَّقُوا فِيهِ ۚ كَبُرَ عَلَى الْمُشْرِكِينَ مَا تَدْعُوهُمْ إِلَيْهِ ۚ اللَّهُ يَجْتَبِي إِلَيْهِ مَنْ يَشَاءُ وَيَهْدِي إِلَيْهِ مَنْ يُنِيبُ","ayah_en":"In matters of faith, He has ordained for you that which He had enjoined upon Noah - and into which We gave thee [O Muhammad] insight through revelation as well as that which We had enjoined upon Abraham, and Moses, and Jesus: Steadfastly uphold the [true] faith, and do not break up your unity therein. [And even though] that [unity of faith] to which thou callest them appears oppressive to those who are wont to ascribe to other beings or forces a share in His divinity, God draws unto Himself everyone who is willing, and guides unto Himself everyone who turns unto Him.","numberInSurah":13,"page":484,"surah_ar":"سُورَةُ الشُّورَىٰ","surah_en":"Ash-Shura"},{"num":195,"ayah_ar":"۞ وَلَوْ بَسَطَ اللَّهُ الرِّزْقَ لِعِبَادِهِ لَبَغَوْا فِي الْأَرْضِ وَلَٰكِنْ يُنَزِّلُ بِقَدَرٍ مَا يَشَاءُ ۚ إِنَّهُ بِعِبَادِهِ خَبِيرٌ بَصِيرٌ","ayah_en":"For, if God were to grant [in this world] abundant sustenance to [all of] His servants, they would behave on earth with wanton insolence: but as it is, He bestows [His grace] from on high in due measure, as He wills: for, verily, He is fully aware of [the needs of] His creatures, and sees them all.","numberInSurah":27,"page":486,"surah_ar":"سُورَةُ الشُّورَىٰ","surah_en":"Ash-Shura"},{"num":196,"ayah_ar":"۞ وَمَا كَانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ اللَّهُ إِلَّا وَحْيًا أَوْ مِنْ وَرَاءِ حِجَابٍ أَوْ يُرْسِلَ رَسُولًا فَيُوحِيَ بِإِذْنِهِ مَا يَشَاءُ ۚ إِنَّهُ عَلِيٌّ حَكِيمٌ","ayah_en":"And it is not given to mortal man that God should speak unto him otherwise than through sudden inspiration, or [by a voice, as it were,] from behind a veil, or by sending an apostle to reveal, by His leave, whatever He wills [to reveal]: for, verily, He is exalted, wise.","numberInSurah":51,"page":488,"surah_ar":"سُورَةُ الشُّورَىٰ","surah_en":"Ash-Shura"},{"num":197,"ayah_ar":"۞ قَالَ أَوَلَوْ جِئْتُكُمْ بِأَهْدَىٰ مِمَّا وَجَدْتُمْ عَلَيْهِ آبَاءَكُمْ ۖ قَالُوا إِنَّا بِمَا أُرْسِلْتُمْ بِهِ كَافِرُونَ","ayah_en":"[Whereupon each prophet] would say, “Why, even though I bring you guidance better than that which you found your forefathers believing in?” - [to which] the others would reply, “Behold, we deny that there is any truth in [what you claim to be] your messages!”","numberInSurah":24,"page":491,"surah_ar":"سُورَةُ الزُّخۡرُفِ","surah_en":"Az-Zukhruf"},{"num":198,"ayah_ar":"۞ وَلَمَّا ضُرِبَ ابْنُ مَرْيَمَ مَثَلًا إِذَا قَوْمُكَ مِنْهُ يَصِدُّونَ","ayah_en":"NOW WHENEVER [the nature of] the son of Mary is set forth as an example, [O Muhammad,] lo! thy people raise an outcry on this score,","numberInSurah":57,"page":493,"surah_ar":"سُورَةُ الزُّخۡرُفِ","surah_en":"Az-Zukhruf"},{"num":199,"ayah_ar":"۞ وَلَقَدْ فَتَنَّا قَبْلَهُمْ قَوْمَ فِرْعَوْنَ وَجَاءَهُمْ رَسُولٌ كَرِيمٌ","ayah_en":"AND, INDEED, [long] before their time did We try Pharaoh’s people [in the same way]: for there came unto them a noble apostle, [who said:]","numberInSurah":17,"page":496,"surah_ar":"سُورَةُ الدُّخَانِ","surah_en":"Ad-Dukhaan"},{"num":200,"ayah_ar":"۞ اللَّهُ الَّذِي سَخَّرَ لَكُمُ الْبَحْرَ لِتَجْرِيَ الْفُلْكُ فِيهِ بِأَمْرِهِ وَلِتَبْتَغُوا مِنْ فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ","ayah_en":"IT IS GOD who has made the sea subservient [to His laws, so that it be of use] to you so that ships might sail through it at His behest, and that you might seek to obtain [what you need] of His bounty, and that you might have cause to be grateful.","numberInSurah":12,"page":499,"surah_ar":"سُورَةُ الجَاثِيَةِ","surah_en":"Al-Jaathiya"},{"num":201,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ حم","ayah_en":"Ha. Mim.","numberInSurah":1,"page":502,"surah_ar":"سُورَةُ الأَحۡقَافِ","surah_en":"Al-Ahqaf"},{"num":202,"ayah_ar":"۞ وَاذْكُرْ أَخَا عَادٍ إِذْ أَنْذَرَ قَوْمَهُ بِالْأَحْقَافِ وَقَدْ خَلَتِ النُّذُرُ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ أَلَّا تَعْبُدُوا إِلَّا اللَّهَ إِنِّي أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ عَظِيمٍ","ayah_en":"AND REMEMBER that brother of [the tribe of] Ad, how - seeing that [other] warnings had already come and gone within his own knowledge as well as in times beyond his ken - he warned his people [who lived] among those sand-dunes: “Worship none but God! Verily, I fear lest suffering befall you on an awesome day!”","numberInSurah":21,"page":505,"surah_ar":"سُورَةُ الأَحۡقَافِ","surah_en":"Al-Ahqaf"},{"num":203,"ayah_ar":"۞ أَفَلَمْ يَسِيرُوا فِي الْأَرْضِ فَيَنْظُرُوا كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِنْ قَبْلِهِمْ ۚ دَمَّرَ اللَّهُ عَلَيْهِمْ ۖ وَلِلْكَافِرِينَ أَمْثَالُهَا","ayah_en":"Have they, then, never journeyed about the earth and beheld what happened in the end to those [willful sinners] who lived before their time? God destroyed them utterly: and the like thereof awaits all who deny the truth.","numberInSurah":10,"page":507,"surah_ar":"سُورَةُ مُحَمَّدٍ","surah_en":"Muhammad"},{"num":204,"ayah_ar":"۞ يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَلَا تُبْطِلُوا أَعْمَالَكُمْ","ayah_en":"O you who have attained to faith! Pay heed unto God, and pay heed unto the Apostle, and let not your [good] deeds come to nought!","numberInSurah":33,"page":510,"surah_ar":"سُورَةُ مُحَمَّدٍ","surah_en":"Muhammad"},{"num":205,"ayah_ar":"۞ لَقَدْ رَضِيَ اللَّهُ عَنِ الْمُؤْمِنِينَ إِذْ يُبَايِعُونَكَ تَحْتَ الشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمْ فَأَنْزَلَ السَّكِينَةَ عَلَيْهِمْ وَأَثَابَهُمْ فَتْحًا قَرِيبًا","ayah_en":"INDEED, well-pleased was God with the believers when they pledged their allegiance unto thee [O Muhammad] under that tree, for He knew what was in their hearts; and so He bestowed inner peace upon them from on high, and rewarded them with [the glad tiding of] a victory soon to come","numberInSurah":18,"page":513,"surah_ar":"سُورَةُ الفَتۡحِ","surah_en":"Al-Fath"},{"num":206,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُقَدِّمُوا بَيْنَ يَدَيِ اللَّهِ وَرَسُولِهِ ۖ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ","ayah_en":"O YOU who have attained to faith! Do not put yourselves forward in the presence of [what] God and His Apostle [may have ordained], but remain conscious of God: for, verily, God is all-hearing, all-knowing!","numberInSurah":1,"page":515,"surah_ar":"سُورَةُ الحُجُرَاتِ","surah_en":"Al-Hujuraat"},{"num":207,"ayah_ar":"۞ قَالَتِ الْأَعْرَابُ آمَنَّا ۖ قُلْ لَمْ تُؤْمِنُوا وَلَٰكِنْ قُولُوا أَسْلَمْنَا وَلَمَّا يَدْخُلِ الْإِيمَانُ فِي قُلُوبِكُمْ ۖ وَإِنْ تُطِيعُوا اللَّهَ وَرَسُولَهُ لَا يَلِتْكُمْ مِنْ أَعْمَالِكُمْ شَيْئًا ۚ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ","ayah_en":"THE BEDOUIN say, “We have attained to faith.” Say [unto them, O Muhammad]: “You have not [yet] attained to faith; you should [rather] say, ‘We have [outwardly] surrendered’ - for [true] faith has not yet entered your hearts. But if you [truly] pay heed unto God and His Apostle, He will not let the least of your deeds go to waste: for, behold, God is much-forgiving, a dispenser of grace.”","numberInSurah":14,"page":517,"surah_ar":"سُورَةُ الحُجُرَاتِ","surah_en":"Al-Hujuraat"},{"num":208,"ayah_ar":"۞ قَالَ قَرِينُهُ رَبَّنَا مَا أَطْغَيْتُهُ وَلَٰكِنْ كَانَ فِي ضَلَالٍ بَعِيدٍ","ayah_en":"Man’s other self’ will say: “O our Sustainer! It was not I that led his conscious mind into evil [nay,] but it had gone far astray [of its own accord]!","numberInSurah":27,"page":519,"surah_ar":"سُورَةُ قٓ","surah_en":"Qaaf"},{"num":209,"ayah_ar":"۞ قَالَ فَمَا خَطْبُكُمْ أَيُّهَا الْمُرْسَلُونَ","ayah_en":"Said [Abraham]: “And what [else] may you have in view, O you [heavenly] messengers?”","numberInSurah":31,"page":522,"surah_ar":"سُورَةُ الذَّارِيَاتِ","surah_en":"Adh-Dhaariyat"},{"num":210,"ayah_ar":"۞ وَيَطُوفُ عَلَيْهِمْ غِلْمَانٌ لَهُمْ كَأَنَّهُمْ لُؤْلُؤٌ مَكْنُونٌ","ayah_en":"And they will be waited upon by [immortal] youths, [as if they were children] of their own, [as pure] as if they were pearls hidden in their shells.","numberInSurah":24,"page":524,"surah_ar":"سُورَةُ الطُّورِ","surah_en":"At-Tur"},{"num":211,"ayah_ar":"۞ وَكَمْ مِنْ مَلَكٍ فِي السَّمَاوَاتِ لَا تُغْنِي شَفَاعَتُهُمْ شَيْئًا إِلَّا مِنْ بَعْدِ أَنْ يَأْذَنَ اللَّهُ لِمَنْ يَشَاءُ وَيَرْضَىٰ","ayah_en":"For, however many angels there be in the heavens, their intercession can be of no least avail [to anyone] - except after God has given leave [to inter­cede] for whomever He wills and with whom He is well-pleased.","numberInSurah":26,"page":526,"surah_ar":"سُورَةُ النَّجۡمِ","surah_en":"An-Najm"},{"num":212,"ayah_ar":"۞ كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ فَكَذَّبُوا عَبْدَنَا وَقَالُوا مَجْنُونٌ وَازْدُجِرَ","ayah_en":"[LONG] BEFORE those [who now deny resurrec­tion] did Noah’s people call it a lie; and they gave the lie to Our servant and said, “Mad is he!” - and he was repulsed.","numberInSurah":9,"page":529,"surah_ar":"سُورَةُ القَمَرِ","surah_en":"Al-Qamar"},{"num":213,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ الرَّحْمَٰنُ","ayah_en":"THE MOST GRACIOUS","numberInSurah":1,"page":531,"surah_ar":"سُورَةُ الرَّحۡمَٰن","surah_en":"Ar-Rahmaan"},{"num":214,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ إِذَا وَقَعَتِ الْوَاقِعَةُ","ayah_en":"WHEN THAT which must come to pass [at last] comes to pass,","numberInSurah":1,"page":534,"surah_ar":"سُورَةُ الوَاقِعَةِ","surah_en":"Al-Waaqia"},{"num":215,"ayah_ar":"۞ فَلَا أُقْسِمُ بِمَوَاقِعِ النُّجُومِ","ayah_en":"NAY, I call to witness the coming-down in parts [of this Qur’an]","numberInSurah":75,"page":536,"surah_ar":"سُورَةُ الوَاقِعَةِ","surah_en":"Al-Waaqia"},{"num":216,"ayah_ar":"۞ أَلَمْ يَأْنِ لِلَّذِينَ آمَنُوا أَنْ تَخْشَعَ قُلُوبُهُمْ لِذِكْرِ اللَّهِ وَمَا نَزَلَ مِنَ الْحَقِّ وَلَا يَكُونُوا كَالَّذِينَ أُوتُوا الْكِتَابَ مِنْ قَبْلُ فَطَالَ عَلَيْهِمُ الْأَمَدُ فَقَسَتْ قُلُوبُهُمْ ۖ وَكَثِيرٌ مِنْهُمْ فَاسِقُونَ","ayah_en":"IS IT NOT time that the hearts of all who have attained to faith should feel humble at the remem­brance of God and of all the truth that has been bestowed [on them] from on high, lest they become like those who were granted revelation aforetime, and whose hearts have hardened with the passing of time so that many of them are [now] depraved?","numberInSurah":16,"page":539,"surah_ar":"سُورَةُ الحَدِيدِ","surah_en":"Al-Hadid"},{"num":217,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ قَدْ سَمِعَ اللَّهُ قَوْلَ الَّتِي تُجَادِلُكَ فِي زَوْجِهَا وَتَشْتَكِي إِلَى اللَّهِ وَاللَّهُ يَسْمَعُ تَحَاوُرَكُمَا ۚ إِنَّ اللَّهَ سَمِيعٌ بَصِيرٌ","ayah_en":"GOD has indeed heard the words of her who pleads with thee concerning her husband, and complains Unto God. And God does hear what you both have to say: verily, God is all-hearing, all-seeing.","numberInSurah":1,"page":542,"surah_ar":"سُورَةُ المُجَادلَةِ","surah_en":"Al-Mujaadila"},{"num":218,"ayah_ar":"۞ أَلَمْ تَرَ إِلَى الَّذِينَ تَوَلَّوْا قَوْمًا غَضِبَ اللَّهُ عَلَيْهِمْ مَا هُمْ مِنْكُمْ وَلَا مِنْهُمْ وَيَحْلِفُونَ عَلَى الْكَذِبِ وَهُمْ يَعْلَمُونَ","ayah_en":"ART THOU NOT aware of those who would be friends with people whom God has condemned? They are neither of you [O believers] nor of those [who utterly reject the truth]: and so they swear to a falsehood the while they know [it to be false].","numberInSurah":14,"page":544,"surah_ar":"سُورَةُ المُجَادلَةِ","surah_en":"Al-Mujaadila"},{"num":219,"ayah_ar":"۞ أَلَمْ تَرَ إِلَى الَّذِينَ نَافَقُوا يَقُولُونَ لِإِخْوَانِهِمُ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ لَئِنْ أُخْرِجْتُمْ لَنَخْرُجَنَّ مَعَكُمْ وَلَا نُطِيعُ فِيكُمْ أَحَدًا أَبَدًا وَإِنْ قُوتِلْتُمْ لَنَنْصُرَنَّكُمْ وَاللَّهُ يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ","ayah_en":"ART THOU NOT aware of how those who would always dissemble [their real feelings] speak to their truth-denying brethren from among the followers of earlier revelation: “If you are driven away, we shall most certainly go forth with you, and shall never pay heed to anyone against you; and if war is waged against you, we shall most certainly come to your succour.” But God bears witness that they are most flagrantly lying:","numberInSurah":11,"page":547,"surah_ar":"سُورَةُ الحَشۡرِ","surah_en":"Al-Hashr"},{"num":220,"ayah_ar":"۞ عَسَى اللَّهُ أَنْ يَجْعَلَ بَيْنَكُمْ وَبَيْنَ الَّذِينَ عَادَيْتُمْ مِنْهُمْ مَوَدَّةً ۚ وَاللَّهُ قَدِيرٌ ۚ وَاللَّهُ غَفُورٌ رَحِيمٌ","ayah_en":"[But] it may well be that God will bring about [mutual] affection between you [O believers] and some of those whom you [now] face as enemies: for, God is all-powerful - and God is much-forgiving, a dispenser of grace.","numberInSurah":7,"page":550,"surah_ar":"سُورَةُ المُمۡتَحنَةِ","surah_en":"Al-Mumtahana"},{"num":221,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ يُسَبِّحُ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ الْمَلِكِ الْقُدُّوسِ الْعَزِيزِ الْحَكِيمِ","ayah_en":"ALL THAT IS in the heavens and all that is on earth extols the limitless glory of God, the Sovereign Supreme, the Holy, the Almighty, the Wise!","numberInSurah":1,"page":553,"surah_ar":"سُورَةُ الجُمُعَةِ","surah_en":"Al-Jumu'a"},{"num":222,"ayah_ar":"۞ وَإِذَا رَأَيْتَهُمْ تُعْجِبُكَ أَجْسَامُهُمْ ۖ وَإِنْ يَقُولُوا تَسْمَعْ لِقَوْلِهِمْ ۖ كَأَنَّهُمْ خُشُبٌ مُسَنَّدَةٌ ۖ يَحْسَبُونَ كُلَّ صَيْحَةٍ عَلَيْهِمْ ۚ هُمُ الْعَدُوُّ فَاحْذَرْهُمْ ۚ قَاتَلَهُمُ اللَّهُ ۖ أَنَّىٰ يُؤْفَكُونَ","ayah_en":"Now when thou seest them, their outward appearance may please thee; and when they speak, thou art inclined to lend ear to what they say. [But though they may seem as sure of themselves] as if they were timbers [firmly] propped up, they think that every shout is [directed] against them. They are the [real] enemies [of all faith], so beware of them. [They deserve the imprecation,] \"May God destroy them!\" How perverted are their minds!","numberInSurah":4,"page":554,"surah_ar":"سُورَةُ المُنَافِقُونَ","surah_en":"Al-Munaafiqoon"},{"num":223,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ يَا أَيُّهَا النَّبِيُّ إِذَا طَلَّقْتُمُ النِّسَاءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحْصُوا الْعِدَّةَ ۖ وَاتَّقُوا اللَّهَ رَبَّكُمْ ۖ لَا تُخْرِجُوهُنَّ مِنْ بُيُوتِهِنَّ وَلَا يَخْرُجْنَ إِلَّا أَنْ يَأْتِينَ بِفَاحِشَةٍ مُبَيِّنَةٍ ۚ وَتِلْكَ حُدُودُ اللَّهِ ۚ وَمَنْ يَتَعَدَّ حُدُودَ اللَّهِ فَقَدْ ظَلَمَ نَفْسَهُ ۚ لَا تَدْرِي لَعَلَّ اللَّهَ يُحْدِثُ بَعْدَ ذَٰلِكَ أَمْرًا","ayah_en":"O PROPHET! When you [intend to divorce women, divorce them with a view to the waiting period appointed for them, and reckon the period [carefully], and be conscious of God, your Sustainer. Do not expel them from their homes; and neither shall they [be made to] leave unless they become openly guilty of immoral conduct. These, then, are the bounds set by God - and he who transgresses the bounds set by God does indeed sin against himself: [for, O man, although] thou knowest it not, after that [first breach] God may well cause something new to come about.","numberInSurah":1,"page":558,"surah_ar":"سُورَةُ الطَّلَاقِ","surah_en":"At-Talaaq"},{"num":224,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ يَا أَيُّهَا النَّبِيُّ لِمَ تُحَرِّمُ مَا أَحَلَّ اللَّهُ لَكَ ۖ تَبْتَغِي مَرْضَاتَ أَزْوَاجِكَ ۚ وَاللَّهُ غَفُورٌ رَحِيمٌ","ayah_en":"O PROPHET! Why dost thou, out of a desire to please [one or another of] thy wives, impose [on thyself] a prohibition of something that God has made lawful to thee? But God is much-forgiving, a dispenser of grace:","numberInSurah":1,"page":560,"surah_ar":"سُورَةُ التَّحۡرِيمِ","surah_en":"At-Tahrim"},{"num":225,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ","ayah_en":"HALLOWED be He in whose hand all dominion rests, since He has the power to will anything:","numberInSurah":1,"page":562,"surah_ar":"سُورَةُ المُلۡكِ","surah_en":"Al-Mulk"},{"num":226,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ ن ۚ وَالْقَلَمِ وَمَا يَسْطُرُونَ","ayah_en":"Nun. CONSIDER the pen, and all that they write [therewith]!","numberInSurah":1,"page":564,"surah_ar":"سُورَةُ القَلَمِ","surah_en":"Al-Qalam"},{"num":227,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ الْحَاقَّةُ","ayah_en":"OH, THE LAYING-BARE of the truth!","numberInSurah":1,"page":566,"surah_ar":"سُورَةُ الحَاقَّةِ","surah_en":"Al-Haaqqa"},{"num":228,"ayah_ar":"۞ إِنَّ الْإِنْسَانَ خُلِقَ هَلُوعًا","ayah_en":"VERILY, man is born with a restless disposition.","numberInSurah":19,"page":569,"surah_ar":"سُورَةُ المَعَارِجِ","surah_en":"Al-Ma'aarij"},{"num":229,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ قُلْ أُوحِيَ إِلَيَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِنَ الْجِنِّ فَقَالُوا إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا","ayah_en":"SAY: \"It has been revealed to me that some of the unseen beings gave ear [to this divine writ], and thereupon said [unto their fellow-beings]: \"'Verily, we have heard a wondrous discourse,","numberInSurah":1,"page":572,"surah_ar":"سُورَةُ الجِنِّ","surah_en":"Al-Jinn"},{"num":230,"ayah_ar":"۞ إِنَّ رَبَّكَ يَعْلَمُ أَنَّكَ تَقُومُ أَدْنَىٰ مِنْ ثُلُثَيِ اللَّيْلِ وَنِصْفَهُ وَثُلُثَهُ وَطَائِفَةٌ مِنَ الَّذِينَ مَعَكَ ۚ وَاللَّهُ يُقَدِّرُ اللَّيْلَ وَالنَّهَارَ ۚ عَلِمَ أَنْ لَنْ تُحْصُوهُ فَتَابَ عَلَيْكُمْ ۖ فَاقْرَءُوا مَا تَيَسَّرَ مِنَ الْقُرْآنِ ۚ عَلِمَ أَنْ سَيَكُونُ مِنْكُمْ مَرْضَىٰ ۙ وَآخَرُونَ يَضْرِبُونَ فِي الْأَرْضِ يَبْتَغُونَ مِنْ فَضْلِ اللَّهِ ۙ وَآخَرُونَ يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ ۖ فَاقْرَءُوا مَا تَيَسَّرَ مِنْهُ ۚ وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَأَقْرِضُوا اللَّهَ قَرْضًا حَسَنًا ۚ وَمَا تُقَدِّمُوا لِأَنْفُسِكُمْ مِنْ خَيْرٍ تَجِدُوهُ عِنْدَ اللَّهِ هُوَ خَيْرًا وَأَعْظَمَ أَجْرًا ۚ وَاسْتَغْفِرُوا اللَّهَ ۖ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ","ayah_en":"BEHOLD, [O Prophet,] thy Sustainer knows that thou keepest awake [in prayer] nearly two-thirds of the night, or one-half of it, or a third of it, together with some of those who follow thee. And God who determines the measure of night and day, is aware that you would never grudge it: and therefore He turns towards you in His grace. Recite, then, as much of the Qur’an as you may do with ease. He knows that in time there will be among you sick people, and others who will go about the land in search of God's bounty, and others who will fight in God’s cause. Recite, then, [only] as much of it as you may do with ease, and be constant in prayer, and spend in charity, and [thus] lend unto God a goodly loan: for whatever good deed you may offer up in your own behalf, you shall truly find it with God - yea, better, and richer in reward. And [always] seek God's forgiveness: behold, God is much-forgiving, a dispenser of grace!","numberInSurah":20,"page":575,"surah_ar":"سُورَةُ المُزَّمِّلِ","surah_en":"Al-Muzzammil"},{"num":231,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ لَا أُقْسِمُ بِيَوْمِ الْقِيَامَةِ","ayah_en":"NAY! I call to witness the Day of Resurrection!","numberInSurah":1,"page":577,"surah_ar":"سُورَةُ القِيَامَةِ","surah_en":"Al-Qiyaama"},{"num":232,"ayah_ar":"۞ وَيَطُوفُ عَلَيْهِمْ وِلْدَانٌ مُخَلَّدُونَ إِذَا رَأَيْتَهُمْ حَسِبْتَهُمْ لُؤْلُؤًا مَنْثُورًا","ayah_en":"And immortal youths will wait upon them: when thou seest them, thou wouldst deem them to be scattered pearls;","numberInSurah":19,"page":579,"surah_ar":"سُورَةُ الإِنسَانِ","surah_en":"Al-Insaan"},{"num":233,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ عَمَّ يَتَسَاءَلُونَ","ayah_en":"ABOUT WHAT do they [most often] ask one another?","numberInSurah":1,"page":582,"surah_ar":"سُورَةُ النَّبَإِ","surah_en":"An-Naba"},{"num":234,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ عَبَسَ وَتَوَلَّىٰ","ayah_en":"HE FROWNED and turned away","numberInSurah":1,"page":585,"surah_ar":"سُورَةُ عَبَسَ","surah_en":"Abasa"},{"num":235,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ إِذَا السَّمَاءُ انْفَطَرَتْ","ayah_en":"WHEN THE SKY is cleft asunder,","numberInSurah":1,"page":587,"surah_ar":"سُورَةُ الانفِطَارِ","surah_en":"Al-Infitaar"},{"num":236,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ إِذَا السَّمَاءُ انْشَقَّتْ","ayah_en":"WHEN THE SKY is split asunder,","numberInSurah":1,"page":589,"surah_ar":"سُورَةُ الانشِقَاقِ","surah_en":"Al-Inshiqaaq"},{"num":237,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى","ayah_en":"EXTOL the limitless glory of thy Sustainer's name: [the glory of] the Al-Highest,","numberInSurah":1,"page":591,"surah_ar":"سُورَةُ الأَعۡلَىٰ","surah_en":"Al-A'laa"},{"num":238,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ لَا أُقْسِمُ بِهَٰذَا الْبَلَدِ","ayah_en":"NAY! I call to witness this land –","numberInSurah":1,"page":594,"surah_ar":"سُورَةُ البَلَدِ","surah_en":"Al-Balad"},{"num":239,"ayah_ar":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ","ayah_en":"HAVE WE NOT opened up thy heart,","numberInSurah":1,"page":596,"surah_ar":"سُورَةُ الشَّرۡحِ","surah_en":"Ash-Sharh"},{"num":240,"ayah_ar":"۞ أَفَلَا يَعْلَمُ إِذَا بُعْثِرَ مَا فِي الْقُبُورِ","ayah_en":"But does he not know that [on the Last Day,] when all that is in the graves is raised and brought out,","numberInSurah":9,"page":599,"surah_ar":"سُورَةُ العَادِيَاتِ","surah_en":"Al-Aadiyaat"}]